Repository: tangt64/duststack-cloudstack-linux
Catalog: man-db-2.8.6.1/man/po4a/po/*.po
Languages: es

source: Manual pager utils
es: Utilidades del paginador manual

source: NAME
es: NOMBRE

source: %apropos% - search the manual page names and descriptions
es: %apropos% - busca los nombres y descripciones de la página del manual

source: SYNOPSIS
es: SINOPSIS

source: B<%apropos%> [\|B<-dalv?V>\|] [\|B<-e>\||\|B<-w>\||\|B<-r>\|] [\|B<-s> I<list>\|] [\|B<-m> I<system>\|[\|,.\|.\|.\|]\|] [\|B<-M> I<path>\|] [\|B<-L> I<locale>\|] [\|B<-C> I<file>\|] I<keyword> \&.\|.\|.
es: B<%apropos%> [\|B<-dalv?V>\|] [\|B<-e>\||\|B<-w>\||\|B<-r>\|] [\|B<-s> I<listado>\|] [\|B<-m> I<sistema>\|[\|,.\|.\|.\|]\|] [\|B<-M> I<ruta>\|] [\|B<-L> I<local>\|] [\|B<-C> I<fichero>\|] I<palabraclave> \&.\|.\|.

source: DESCRIPTION
es: DESCRIPCIÓN

source: Each manual page has a short description available within it. B<%apropos%> searches the descriptions for instances of I<keyword>.
es: Cada página del manual tiene una breve descripción disponible con éste. B<%apropos%> busca las descripciones para instancias de I<palabrasclave>.

source: I<keyword> is usually a regular expression, as if (B<-r>) was used, or may contain wildcards (B<-w>), or match the exact keyword (B<-e>). Using these options, it may be necessary to quote the I<keyword> or escape (\e) the special characters to stop the shell from interpreting them.
es: Una I<palabraclave> es una expresión regular usual, como si (B<-r>) fuera empleada, o quizá contenga comodines (B<-w>), o coincida la palabra clave exacta (B<-e>). Utilizando estas opciones, quizá sean necesarias para entrecomillar la I<palabraclave> o escape (\e) para los caracteres especiales para detener la shell de la interpretación de éstos.

source: The standard matching rules allow matches to be made against the page name and word boundaries in the description.
es: Las reglas de coincidencia comunes permiten coincidencias para hacerlas frente al número de página y bordes de palabra en la descripción.

source: The database searched by B<%apropos%> is updated by the B<%mandb%> program. Depending on your installation, this may be run by a periodic cron job, or may need to be run manually after new manual pages have been installed.
es: La BD buscada por B<%apropos%> está actualizadada por el programa B<%mandb%>. Dependiendo en su instalación, esto quizá es ejecutado por una tarea cron periódica, o quizá necesita ser ejecutado manualmente tras instalarse páginas nuevas del manual.

source: OPTIONS
es: OPCIONES

source: Print debugging information.
es: Muestra información depurativa.

source: Print verbose warning messages.
es: Muestra mensajes detallados de advertencia.

source: Interpret each keyword as a regular expression. This is the default behaviour. Each keyword will be matched against the page names and the descriptions independently. It can match any part of either. The match is not limited to word boundaries.
es: Interpreta cada palabra clave como una expresión regular. Esto es el comportamiento por omisión. Cada palabra clave será coincidente frente a los nombres de página y la descripción independientemente. Puede coincidir cualquier parte de ambos. La coincidencia no está limitada a las palabras partidas en los bordes.

source: Interpret each keyword as a pattern containing shell style wildcards. Each keyword will be matched against the page names and the descriptions independently. If B<--exact> is also used, a match will only be found if an expanded keyword matches an entire description or page name. Otherwise the keyword is also allowed to match on word boundaries in the description.
es: Interpreta cada palabra clave como un patrón conteniendo comodines de estilo shell. Cada palabra clave será coincidente frente a los nombres de página y la descripción independientemente. Si B<--exact> se emplea también, una coincidencia será solo encontrada si una palabra clave expandida coincide una descripción entera o nombre de página. En otro caso la palabra clave también permite que coincida en los bordes de palabras dentro de la descripción.

source: Each keyword will be exactly matched against the page names and the descriptions.
es: Cada teclado será exactamente coincidente frente a nombres de página y las descripciones.

source: Only display items that match all the supplied keywords. The default is to display items that match any keyword.
es: Solo enseña ítemes que coincide con todoas las palabras clave suministradas. Lo predeterminado es enseñar ítemes que coincidan cualquier palabra clave.

source: Do not trim output to the terminal width. Normally, output will be truncated to the terminal width to avoid ugly results from poorly-written B<NAME> sections.
es: No corta la salida a la anchura del terminal. Normalmente, la salida será truncada al ancho del terminal para evitar resultados indeseables de las secciones de B<NOMBRE> pobremente escritas.

source: B<-s> I<list>, B<--sections> I<list>, B<--section> I<list>
es: B<-s> I<listado>, B<--section> I<listado>, B<--section> I<listado>

source: Search only the given manual sections. I<list> is a colon- or comma-separated list of sections. If an entry in I<list> is a simple section, for example "3", then the displayed list of descriptions will include pages in sections "3", "3perl", "3x", and so on; while if an entry in I<list> has an extension, for example "3perl", then the list will only include pages in that exact part of the manual section.
es: Busca solo las secciones del manual dadas. I<listado> es una lista de secciones coloreada separadas por comas. Si una entrada en el I<listado> es una sección simple, por ejemplo "3", entonces la lista de descripción enseñada incluirá páginas en secciones "3", "3perl", "3x", y así; mientras si una entrada en el I<listado> tiene una extensión, por ejemplo "3perl", entones la lista solo incluirá páginas dentro de esa parte exacta de la sección del manual.

source: B<-m> I<system>\|[\|,.\|.\|.\|]\|, B<--systems=>I<system>\|[\|,.\|.\|.\|]
es: B<-m> I<sistema>\|[\|,.\|.\|.\|]\|, B<--systems=>I<sistema>\|[\|,.\|.\|.\|]

source: If this system has access to other operating system's manual page descriptions, they can be searched using this option. To search NewOS's manual page descriptions, use the option B<-m> B<NewOS>.
es: Si este sistema ha accedido a otras descripciones del manual de sistema operativo, pueden buscarse utilizando esta opción. Para buscar descripciones de página del manual SOnuevo, utilice la opción B<-m> B<SOnuevo>.

source: The I<system> specified can be a combination of comma-delimited operating system names. To include a search of the native operating system's B<whatis> descriptions, include the system name B<man> in the argument string. This option will override the $B<SYSTEM> environment variable.
es: El I<sistema> especificado puede ser una combinación de nombres del sistema operativo separado por comas. Para incluir una búsqueda descripciones B<whatis> del sistema operativo nativo, incluya el nombre del sistema B<man> en la cadena de argumento. Esta opción anula la variable $B<SYSTEM> del entorno.

source: B<-M\ >I<path>,\ B<--manpath=>I<path>
es: B<-M\ >I<ruta>,\ B<--manpath=>I<ruta>

source: Specify an alternate set of colon-delimited manual page hierarchies to search. By default, B<%program%> uses the $B<MANPATH> environment variable, unless it is empty or unset, in which case it will determine an appropriate manpath based on your $B<PATH> environment variable. This option overrides the contents of $B<MANPATH>.
es: Especifica un conjunto alternativo de página del manual delimitado por dos puntos (:) jerárquicos para búsqueda. Por defecto, B<%program%> utiliza la variable de entorno $B<MANPATH>, a no ser que esté vacía o no determinada, en cualquier caso determinará una ruta del man apropiado basado en su variable del entorno $B<MANPATH>.

source: B<-L\ >I<locale>,\ B<--locale=>I<locale>
es: B<-L\ >I<local>,\ B<--locale=>I<local>

source: B<%program%> will normally determine your current locale by a call to the C function B<setlocale>(3) which interrogates various environment variables, possibly including $B<LC_MESSAGES> and $B<LANG>. To temporarily override the determined value, use this option to supply a I<locale> string directly to B<%program%>. Note that it will not take effect until the search for pages actually begins. Output such as the help message will always be displayed in the initially determined locale.
es: El B<%programa%> normalmente no determinará su actual localización para una llamada a la función C B<setlocale>(3) la cual pregunta varias variables de entorno, posiblemente incluyendo $B<LC_MESSAGES> y $B<LANG>. Para temporalmente sobrescribir el valor determinado, utilice esta opción para suministrar una cadena I<local> directamente al B<%program%>. Anote que no tomará efecto hasta que la búsqueda para páginas actualmente comiencen. Salidas como el mensaje de ayuda siempre será mostrado en la localización inicialmente determinada.

source: B<-C\ >I<file>,\ B<--config-file=>I<file>
es: B<-C\ >I<fichero>,\ B<--config-file=>I<fichero>

source: Use this user configuration file rather than the default of I<~/.manpath>.
es: Utilice este fichero de configuracion de usuario mejor que el predeterminado de I<~/.manpath>.

source: Print a help message and exit.
es: Escribe un mensaje de ayuda y termina.

source: Print a short usage message and exit.
es: Escribe mensaje breve sobre uso del programa y termina.

source: Display version information.
es: Enseña la versión de información.

source: EXIT STATUS
es: ESTADO DE SALIDA

source: Successful program execution.
es: Ejecución del programa correcta.

source: Usage, syntax or configuration file error.
es: Utilización, sintaxis o error del fichero de configuración.

source: Operational error.
es: Error operacional.

source: Nothing was found that matched the criteria specified.
es: Nada fue encontrado coincidendo con el criterio especificado.

source: ENVIRONMENT
es: ENTORNO

source: If $B<SYSTEM> is set, it will have the same effect as if it had been specified as the argument to the B<-m> option.
es: Si se establece $B<SYSTEM>, tendrá el mismo efecto que si tuvo que ser especificado como el argumento a la opción B<-m>.

source: If $B<MANPATH> is set, its value is interpreted as the colon-delimited manual page hierarchy search path to use.
es: Si se establece $B<MANPATH>, su valor es interpretado como la jerarquización de página manual delimitada por dos puntos.

source: If $B<MANWIDTH> is set, its value is used as the terminal width (see the B<--long> option). If it is not set, the terminal width will be calculated using the value of $B<COLUMNS>, an B<ioctl>(2) if available, or falling back to 80 characters if all else fails.
es: Si se establece $B<MANWIDTH>, su valor es utilizado como la anchura del terminal (vea la opción B<--long>). Si no está establecida, la anchura de la terminal será calculada utilizando el valor de $B<COLUMNAS>, un B<ioctl>(2) si está disponible, o volviendo a los 80 caracteres si todo eso falla.

source: If $B<POSIXLY_CORRECT> is set, even to a null value, the default B<%apropos%> search will be as an extended regex (B<-r>). Nowadays, this is the default behaviour anyway.
es: Si se establece $B<POSIXLY_CORRECT>, incluso a un valor nulo, la búsqueda predeterminada B<%apropos%> será como una expreg extendida (B<-r>). Por otro lado, esto es el comportamiento predeterminado en cualquier lugar.

source: FILES
es: FICHEROS

source: A traditional global I<index> database cache.
es: Una caché de BD I<indexado> global tradicional.

source: An FHS compliant global I<index> database cache.
es: Una caché de BD I<indexado> compatible FHS.

source: A traditional B<whatis> text database.
es: Un texto tradicional B<whatis> de BD.

source: SEE ALSO
es: VEA ADEMÁS

source: AUTHOR
es: AUTOR

source: lexgrog - parse header information in man pages
es: lexgrog - interpreta información de cabecera en páginas man

source: B<lexgrog> [\|B<-m>\||\|B<-c>\|] [\|B<-dfw?V>\|] [\|B<-E> I<encoding>\|] I<file> \&.\|.\|.
es: B<lexgrog> [\|B<-m>\||\|B<-c>\|] [\|B<-dfw?V>\|] [\|B<-E> I<codificando>\|] I<fichero> \&.\|.\|.

source: B<lexgrog> is an implementation of the traditional \(lqgroff guess\(rq utility in B<lex>. It reads the list of files on its command line as either man page source files or preformatted \(lqcat\(rq pages, and displays their name and description as used by B<apropos> and B<whatis>, the list of preprocessing filters required by the man page before it is passed to B<nroff> or B<troff>, or both.
es: B<lexgrog> es una interpretación de la tradicional \(lqgroff guess\(rq utilidad en B<lex>. Lee la lista de ficheros en su línea de órdenes o como fichero de origen de una página man o como \(lqcat\(rq páginas preformateadas, y enseña su nombre y descripción como se utilizó por B<apropos> y B<whatis>, la lista de filtros preprocesados requeridos por la página man antes que sea pasada por B<nroff> o B<troff>, o ambos.

source: If its input is badly formatted, B<lexgrog> will print \(lqparse failed\(rq; this may be useful for external programs that need to check man pages for correctness. If one of B<lexgrog>'s input files is \(lq-\(rq, it will read from standard input; if any input file is compressed, a decompressed version will be read automatically.
es: Si esta entrada está formateado equivocadamente, B<lexgrog> escribirá \(lqparse fallado\(rq; esta quizá sea útil para programas externos que requeirean comprobar páginas man para correcciones. Si uno de los ficheros de entrada de B<lexgrog> es \(lq-\(rq, leerá desde entrada comúnM si cualquier fichero entrante está comprimido, una versión descomprimida será se leerá automáticamente.

source: Parse input as man page source files. This is the default if neither B<--man> nor B<--cat> is given.
es: Interreta entrada como fichero origen de página man. Esto es lo predefinido si ni B<--man> ni B<--cat> es dado.

source: Parse input as preformatted man pages (\(lqcat pages\(rq). B<--man> and B<--cat> may not be given simultaneously.
es: Entrada interpretada como páginas (\(lqcat\(rq) man preformateada. B<--man> y B<--cat> quizá no son dadas simultáneamente.

source: Display the name and description from the man page's header, as used by B<apropos> and B<whatis>. This is the default if neither B<--whatis> nor B<--filters> is given.
es: Enseña el nombre y descripción desde la cabecera de la página del man, tal emplado por B<apropósito> y B<qué es>. Esto es lo predeterminado si ni B<--watis> ni B<--filters> está dado.

source: Display the list of filters needed to preprocess the man page before formatting with B<nroff> or B<troff>.
es: Enseña la lista de filtros necesarios para preprocesar la página man antes de formatear con B<nroff> o B<troff>.

source: B<-E> I<encoding>, B<--encoding> I<encoding>
es: B<-E> I<codificación>, B<--encoding> I<codificación>

source: Override the guessed character set for the page to I<encoding>.
es: Sobrescribe el conjunto de caracteres deseado para la página a I<codificación>.

source: Usage error.
es: Error de uso.

source: B<lexgrog> failed to parse one or more of its input files.
es: B<lexgrog> falló al interpretar uno o más de ficheros entrantes.

source: EXAMPLES
es: EJEMPLOS

source: $ lexgrog man.1 man.1: "man - an interface to the on-line reference manuals" $ lexgrog -fw man.1 man.1 (t): "man - an interface to the on-line reference manuals" $ lexgrog -c whatis.cat1 whatis.cat1: "whatis - display manual page descriptions" $ lexgrog broken.1 broken.1: parse failed
es: $ lexgrog man.1 man.1: «man - un interfaz para manuales referenciados por conexión» $ lexgrog -fw man.1 man.1 (t): «man - un interfaz para manuales referenciados por conexión» $ lexgrog -c whatis.cat1 whatis.cat1: «whatis - enseña páginas descritas del manual» $ lexgrog broken.1 broken.1: interpretador fallado

source: WHATIS PARSING
es: INTERPRETACIÓN “WHATIS”

source: B<%mandb%> (which uses the same code as B<lexgrog>) parses the B<NAME> section at the top of each manual page looking for names and descriptions of the features documented in each. While the parser is quite tolerant, as it has to cope with a number of different forms that have historically been used, it may sometimes fail to extract the required information.
es: B<%mandb%> (el cual emplea el mismo código que B<lexgrog> interpreta la sección B<NOMBRE> al techo de cada página del manual buscando nombres y descripciones de las características documentadas en cada una. Mientras el interprete está muy toletante, como tiene ocuparse con un número de formatos diferentes que tiene históricamente sido empleada, quizá algunas veces fallan al extraer la información requerida.

source: When using the traditional I<man> macro set, a correct B<NAME> section looks something like this:
es: Cuando utilice la macro tradicional I<man>, una sección correcta B<NOMBRE> aparecerá algo como esto:

source: CW<\&.SH NAME foo \e- program to do something>
es: CW<\&.SH NOMBRE rellena \e- programa para hacer algo>

source: Some manual pagers require the \(oq\e-\(cq to be exactly as shown; B<%mandb%> is more tolerant, but for compatibility with other systems it is nevertheless a good idea to retain the backslash.
es: Algunos paginadores manuales requieren la \(oq\e-\(cq esté exactamente como muestran; B<%mandb%> es más tolerante, pero para compatibilidad con otros sistemas no es una buena idea para retener la barra invertida.

source: On the left-hand side, there may be several names, separated by commas. Names containing whitespace will be ignored to avoid pathological behaviour on certain ill-formed B<NAME> sections. The text on the right-hand side is free-form, and may be spread over multiple lines. If several features with different descriptions are being documented in the same manual page, the following form is therefore used:
es: En el lado izquierdo, quizá hay varios nombres, separados por comas. Los nombres conteniendo espacios en blanco serán ignorados para evitar comportamiento patológico en ciertos formatos de secciones B<NOMBRE>. El texto en el lado derecho tiene formato libre, y quizá está desplegado por múltiples líneas. Si varias características con descripciones diferentes están siendo documentadas en la misma página del manual, el siguiente formato está ya utilizado:

source: CW<\&.SH NAME foo, bar \e- programs to do something \&.br baz \e- program to do nothing>
es: CW<\&.SH NAME esto, aquello \e- programas para hacer algo \&.br baz \e- programa para no hacer nada>

source: (A macro which starts a new paragraph, like CW<.PP>, may be used instead of the break macro CW<.br>.)
es: (Una macro la cual inicia un parágrafo nuevo, como CW<.PP>, quizá está utilizado en lugar de ruptura de macro CW<.br>.)

source: When using the BSD-derived I<mdoc> macro set, a correct B<NAME> section looks something like this:
es: Cuando utilice las derivaciones BSD el conjunto de macro I<mdoc>, un B<NOMBRE> de sección correcto parece algo como esto:

source: CW<\&.Sh NAME \&.Nm foo \&.Nd program to do something>
es: CW<\&.Sh NOMBRE \&.Nm lo que sea \&.Nd programa para hacer algo>

source: There are several common reasons why whatis parsing fails. Sometimes authors of manual pages replace \(oq.SH NAME\(cq with \(oq.SH MYPROGRAM\(cq, and then B<%mandb%> cannot find the section from which to extract the information it needs. Sometimes authors include a NAME section, but place free-form text there rather than \(oqname \e- description\(cq. However, any syntax resembling the above should be accepted.
es: Hay distintas razones comunes por las que interpretaciones fallan. Algunas veces los autores de las páginas del manual sustituyen \(oq.SH NOMBRE\(cq por \(oq.SH MIPROGRAMA\(cq, y entonces B<%mandb%> no puede encontrar la sección desde la cual extraer la información que necesita. Algunas veces los autores inclyen una sección NOMBRE, pero colocan texto de formato-libre en lugar de \(oqname \e- description\(cq. Sin embargo, cualquier sintaxis analizada encima debería ser aceptada.

source: NOTES
es: ANOTACIONES

source: B<lexgrog> attempts to parse files containing .so requests, but will only be able to do so correctly if the files are properly installed in a manual page hierarchy.
es: B<lexgrog> intenta entender ficheros conteniendo peticiones .so, perot no serán capaces de hacer tan correctamente si los ficheros son propiamente instalados dentro de una jerarquía de página del manual.

source: The code used by B<lexgrog> to scan man pages was written by:
es: El código utilizado por B<lexgrog> para analizar páginas man fue escrito por:

source: Colin Watson wrote the current incarnation of the command-line front-end, as well as this man page.
es: Colin Watson escribió la actual encarnación dela línea de órdenes frontal, así como esta página del man.

source: %man% - an interface to the on-line reference manuals
es: %man% - un interfaz para las referencias de manuales por conexión

source: B<%man%> [\|B<-C> I<file>\|] [\|B<-d>\|] [\|B<-D>\|] [\|B<--warnings>\|[\|=I<warnings>\|]\|] [\|B<-R> I<encoding>\|] [\|B<-L> I<locale>\|] [\|B<-m> I<system>\|[\|,.\|.\|.\|]\|] [\|B<-M> I<path>\|] [\|B<-S> I<list>\|] [\|B<-e> I<extension>\|] [\|B<-i>\||\|B<-I>\|] [\|B<--regex>\||\|B<--wildcard>\|] [\|B<--names-only>\|] [\|B<-a>\|] [\|B<-u>\|] [\|B<--no-subpages>\|] [\|B<-P> I<pager>\|] [\|B<-r> I<prompt>\|] [\|B<-7>\|] [\|B<-E> I<encoding>\|] [\|B<--no-hyphenation>\|] [\|B<--no-justification>\|] [\|B<-p> I<string>\|] [\|B<-t>\|] [\|B<-T>\|[\|I<device>\|]\|] [\|B<-H>\|[\|I<browser>\|]\|] [\|B<-X>\|[\|I<dpi>\|]\|] [\|B<-Z>\|] [\|[\|I<section>\|] I<page>[.\|I<section>\|]\ \|.\|.\|.\|]\ .\|.\|.\&
es: B<%man%> [\|B<-C> I<fichero>\|] [\|B<-d>\|] [\|B<-D>\|] [\|B<--warnings>\|[\|=I<advertencia>\|]\|] [\|B<-R> I<codificación>\|] [\|B<-L> I<localización>\|] [\|B<-m> I<sistema>\|[\|,.\|.\|.\|]\|] [\|B<-M> I<ruta>\|] [\|B<-S> I<listado>\|] [\|B<-e> I<extensión>\|] [\|B<-i>\||\|B<-I>\|] [\|B<--regex>\||\|B<--wildcard>\|] [\|B<--names-only>\|] [\|B<-a>\|] [\|B<-u>\|] [\|B<--no-subpages>\|] [\|B<-P> I<paginador>\|] [\|B<-r> I<réplica>\|] [\|B<-7>\|] [\|B<-E> I<codificación>\|] [\|B<--no-hyphenation>\|] [\|B<--no-justification>\|] [\|B<-p> I<cadena textual>\|] [\|B<-t>\|] [\|B<-T>\|[\|I<dispositivo>\|]\|] [\|B<-H>\|[\|I<explorador>\|]\|] [\|B<-X>\|[\|I<ppp>\|]\|] [\|B<-Z>\|] [\|[\|I<sección>\|] I<página>[.\|I<sección>\|]\ \|.\|.\|.\|]\ .\|.\|.\&

source: B<%man%> B<-k> [\|I<apropos> I<options>\|] I<regexp> \&.\|.\|.\&
es: B<%man%> B<-k> [\|I<propósito> I<opciones>\|] I<expreg> \&.\|.\|.\&

source: B<%man%> B<-K> [\|B<-w>\||\|B<-W>\|] [\|B<-S> I<list>\|] [\|B<-i>\||\|B<-I>\|] [\|B<--regex>\|] [\|I<section>\|] I<term>\ .\|.\|.\&
es: B<%man%> B<-K> [\|B<-w>\||\|B<-W>\|] [\|B<-S> I<listado>\|] [\|B<-i>\||\|B<-I>\|] [\|B<--regex>\|] [\|I<sección>\|] I<término>\ .\|.\|.\&

source: B<%man%> B<-f> [\|I<whatis> I<options>\|] I<page> \&.\|.\|.\&
es: B<%man%> B<-f> [\|I<qué es> I<opciones>\|] I<página> \&.\|.\|.\&

source: B<%man%> B<-l> [\|B<-C> I<file>\|] [\|B<-d>\|] [\|B<-D>\|] [\|B<--warnings>\|[\|=I<warnings>\|]\|] [\|B<-R> I<encoding>\|] [\|B<-L> I<locale>\|] [\|B<-P> I<pager>\|] [\|B<-r> I<prompt>\|] [\|B<-7>\|] [\|B<-E> I<encoding>\|] [\|B<-p> I<string>\|] [\|B<-t>\|] [\|B<-T>\|[\|I<device>\|]\|] [\|B<-H>\|[\|I<browser>\|]\|] [\|B<-X>\|[\|I<dpi>\|]\|] [\|B<-Z>\|] I<file> \&.\|.\|.\&
es: B<%man%> B<-l> [\|B<-C> I<fichero>\|] [\|B<-d>\|] [\|B<-D>\|] [\|B<--warnings>\|[\|=I<aviso>\|]\|] [\|B<-R> I<codificación>\|] [\|B<-L> I<localización>\|] [\|B<-P> I<paginador>\|] [\|B<-r> I<prompt>\|] [\|B<-7>\|] [\|B<-E> I<codificando>\|] [\|B<-p> I<cadena textual>\|] [\|B<-t>\|] [\|B<-T>\|[\|I<dispositivo>\|]\|] [\|B<-H>\|[\|I<explorar>\|]\|] [\|B<-X>\|[\|I<ppp>\|]\|] [\|B<-Z>\|] I<fichero> \&.\|.\|.\&
