Repository: tangt64/duststack-cloudstack-linux
Catalog: man-db-2.8.6.1/man/po4a/po/*.po
Languages: es

source: If $B<BROWSER> is set, its value is a colon-delimited list of commands, each of which in turn is used to try to start a web browser for B<man> B<--html>. In each command, I<%s> is replaced by a filename containing the HTML output from B<groff>, I<%%> is replaced by a single percent sign (%), and I<%c> is replaced by a colon (:).
es: Si $B<BROWSER> está establecido, su valor es un listado delimitado por los dos puntos, cada uno de los cuales en su turno se emplea para probar a iniciar un explorador web para B<man>, B<--html>. En cada mandato, I<%s> se sustituye por un nombre de fichero conteniendo la salida HTML desde el B<groff>, I<%%> se sustituye por un único signo de porcentaje (%), y I<%c> es sustituído por los dos puntos (:).

source: If $B<MANOPT> is set, it will be parsed prior to B<%man%'s> command line and is expected to be in a similar format. As all of the other B<%man%> specific environment variables can be expressed as command line options, and are thus candidates for being included in $B<MANOPT> it is expected that they will become obsolete. N.B. All spaces that should be interpreted as part of an option's argument must be escaped.
es: Si $B<MANOPT> está establecido, será interpretado antes que las líneas de mandato B<%man%> y está esperada para estar dentro de un formato similar. Tal como toda variable B<%man%> de entorno específico puede ser expresado como opciones de línea de mandato, y por lo tanto son candidatos para ser incluídos en $B<MANOPT> expresado que será convertido en obsoleto. N.B. Todos los espaciones que debería ser interpretado como parte de un argumento opcional debe ser con el escape.

source: If $B<MANWIDTH> is set, its value is used as the line length for which manual pages should be formatted. If it is not set, manual pages will be formatted with a line length appropriate to the current terminal (using the value of $B<COLUMNS>, an B<ioctl>(2) if available, or falling back to 80 characters if neither is available). Cat pages will only be saved when the default formatting can be used, that is when the terminal line length is between 66 and 80 characters.
es: Si $B<MANWITH> está establecido, su valor será empleado como la longitud de línea paa la cual las páginas del manual deberían ser formateadas. Si no está configurado, las páginas del manual serán formatedas con una longitud de línea aproximada para el terminal actual (utilizando el valor de $B<COLUMNS>, y B<ioctl>(2) si está disponible, volviando a los 80 caracteres si no hay nada disponible). Las páginas cat solo serán guardadas cuando el formato predeterminado puede utilizarse, que es cuando el ancho de la línea del terminal está entre 66 y 80 caracteres.

source: Normally, when output is not being directed to a terminal (such as to a file or a pipe), formatting characters are discarded to make it easier to read the result without special tools. However, if $B<MAN_KEEP_FORMATTING> is set to any non-empty value, these formatting characters are retained. This may be useful for wrappers around B<%man%> that can interpret formatting characters.
es: Normalmente, cuando la salida no está siendo dirigida a un terminal (como un ficheor o una tubería), formateando caracteres son descartados para hacerlo más fácil de leer sin emplear herramientas especiales. Sin embargo, si $B<MAN_KEEP_FORMATTING> está establecido a cualquier valor no vacío, estos caracteres de formato esan retenidos. Esto quizá sea útil para cubrir B<%man%> que puedan interpretar caracteres formateados.

source: Normally, when output is being directed to a terminal (usually to a pager), any error output from the command used to produce formatted versions of manual pages is discarded to avoid interfering with the pager's display. Programs such as B<groff> often produce relatively minor error messages about typographical problems such as poor alignment, which are unsightly and generally confusing when displayed along with the manual page. However, some users want to see them anyway, so, if $B<MAN_KEEP_STDERR> is set to any non-empty value, error output will be displayed as usual.
es: Normalmente, cuanod la salida sea directa a un terminal (usualmente a un paginador), cualquier error de salida desde el mandato utilizado para producir versiones formateadas de páginas del manul está descartado para evitar interferir con la representación del paginador mostrado. Los programas como B<groff> a menudo producen mensajes erróneos relativamente pequeños acerca de problemas de tipografías como alineamiento pobre, el cual se encuentra no cercano y generalmente confundiendo cuando representa a lo largo de la página del manual. Sin embargo, algunos usuarios quieren verlos de todas formas, por lo que, si se establece $B<MAN_KEEP_STDERR> a cyakquer valor no vacío, la salida de error derá mostrada como usual.

source: Depending on system and implementation, either or both of $B<LANG> and $B<LC_MESSAGES> will be interrogated for the current message locale. B<%man%> will display its messages in that locale (if available). See B<setlocale>(3) for precise details.
es: Dependiendo en sistema e implementación, o bien uno o ambos de $B<IDIOMA> y $B<LC_MESSAGES> será interrogado para la actual localización del mensaje. B<%man%> enseñará sus mensajes en ese local (si es disponible). Vea B<setlocale>(3) para detalles específicos.

source: man-db configuration file.
es: configuración de fichero man-db.

source: A global manual page hierarchy.
es: Una jerarquía global de paginado manual.

source: the man-db package manual, B<FSSTND>
es: el manual del paquete man-db, B<FSSTND>

source: HISTORY
es: HISTORIAL

source: 1990, 1991 \(en Originally written by John W.\& Eaton (jwe@che.utexas.edu).
es: 1990 \(en 1991: Originalmente escrito por John W.\& Eaton (jwe@che.utexas.edu).

source: Dec 23 1992: Rik Faith (faith@cs.unc.edu) applied bug fixes supplied by Willem Kasdorp (wkasdo@nikhefk.nikef.nl).
es: 23 de diciembre de 1992: Rik Faith (faith@cs.unc.edu) aplicó un arreglo de defecto proporcionado por Willem Kasdorp (wkasdo@nikhefk.nikef.nl).

source: 30th April 1994 \(en 23rd February 2000: Wilf. (G.Wilford@ee.surrey.ac.uk) has been developing and maintaining this package with the help of a few dedicated people.
es: El 30 de abril de 1994 \(en 23 de febrero del 2000: Wilf. (G.Wilford@ee.surrey.ac.uk) ha sido desarrollado y mantenido con la ayuda de una gente dedicada.

source: 30th October 1996 \(en 30th March 2001: Fabrizio Polacco E<lt>fpolacco@debian.orgE<gt> maintained and enhanced this package for the Debian project, with the help of all the community.
es: El 30 de octubre de 1996 \(en 30 de marzo de 2001: Fabrizio Polacco E<lt>fpolacco@debian.orgE<gt> mantuvo y mejoró este paquete para el proyecto Debian, con la ayuda de toda la comunidad.

source: 31st March 2001 \(en present day: Colin Watson E<lt>cjwatson@debian.orgE<gt> is now developing and maintaining man-db.
es: El 31 de marzo de 2001 \(en día presente: Colin Watson E<lt>cjwatson@debian.orgE<gt> ahora está desarrollando y manteniendo man-db.

source: %manconv% - convert manual page from one encoding to another
es: %manconv% - convierte página del manual desde una codificación a otra

source: B<%manconv%> B<-f> I<from-code>\|[:I<from-code>\|.\|.\|.] B<-t> I<to-code> [\|B<-dqhV>\|] [\|I<filename>\|]
es: B<%manconv%> B<-f> I<código-origen>\|[:I<código-origen>\|.\|.\|.] B<-t> I<código-destino> [\|B<-dqhV>\|] [\|I<nombrefichero>\|]

source: B<%manconv%> converts a manual page from one encoding to another, like B<iconv>. Unlike B<iconv>, it can try multiple possible input encodings in sequence. This is useful for manual pages installed in directories without an explicit encoding declaration, since they may be in UTF-8 or in a legacy character set.
es: B<%manconv%> convierte una página manual desde una codificación a otra, como B<iconv>. A diferencia de B<iconv>, puede probar múltiples codificaciones entrantes secuenciales. Esto es útil para páginas manualmente instaladas sin una declaración específica de codificación, debido a que quizá están en UTF-8 o en un conjunto de caracteres heredados.

source: If an encoding declaration is found on the first line of the manual page, that declaration overrides any input encodings specified on B<%manconv%>'s command line. Encoding declarations have the following form:
es: Si una declaración decodificada es encotrada en la primera línea de la página del manual, esa declaración sobrescribe cualquier codificación de entrada por línea de órdenes B<%manconv%>. Codificando declaraciones tiene el formato siguiente:

source: or (if manual page preprocessors are also to be declared):
es: o (si preprocesadores de página del manual son también declarados):

source: B<-f> I<encodings>, B<--from-code> I<encodings>
es: B<-f> I<codificaciones>, B<--from-code> I<codificaciones>

source: Try each of I<encodings> (a colon-separated list) in sequence as the input encoding.
es: Trata cada I<codificación> (una lista separada por dos puntos) en secuencia como la codificación entrante.

source: B<-t> I<encoding>, B<--to-code> I<encoding>
es: B<-t> I<codificando>, B<--to-code> I<codificando>

source: Convert the manual page to I<encoding>.
es: Convierte la página manual a I<codificación>.

source: Do not issue error messages when the page cannot be converted.
es: No emite mensajes de error cuando la página no puede ser convertida.

source: %manpath% - determine search path for manual pages
es: %manpath% - establece ruta de búsqueda para páginas del manual

source: B<%manpath%> [\|B<-qgdc?V>\|] [\|B<-m> I<system>\|[\|,.\|.\|.\|]\|] [\|B<-C> I<file>\|]
es: B<%manpath%> [\|B<-qgdc?V>\|] [\|B<-m> I<sistema>\|[\|,.\|.\|.\|]\|] [\|B<-C> I<fichero>\|]

source: If $B<MANPATH> is set, B<%manpath%> will simply display its contents and issue a warning. If not, B<%manpath%> will determine a suitable manual page hierarchy search path and display the results.
es: Si se activa $B<MANPATH>, B<%manpath%> simplificará la vista de sus contendos y efectuará una advertencia. Si no, B<%manpath%> determinará una jerarquía de página del manual buscando rutas y enseñará los resultados.

source: The colon-delimited path is determined using information gained from the man-db configuration file - (I<%manpath_config_file%>) and the user's environment.
es: La ruta de color delimitado está determinado utilizando información obtenida desde el fichero configurable man-db - (I<%manpath_config_file%>) y el entorno del usuario.

source: Do not issue warnings.
es: No emitir advertencias.

source: Produce a catpath as opposed to a manpath. Once the manpath is determined, each path element is converted to its relative catpath.
es: Produce una ruta concatenada como oposición a una ruta man. Una vez la ruta man es determnada, cada elemento de ruta es convertido a su ruta concatenada relativa.

source: Produce a manpath consisting of all paths named as `global' within the man-db configuration file.
es: Produce una ruta manpath consistente de todas las rutas nombradas como `global' dentro del fichero configurable man-db.

source: If this system has access to other operating system's manual hierarchies, this option can be used to include them in the output of B<%manpath%>. To include NewOS's manual page hierarchies use the option B<-m> B<NewOS>.
es: Si este sistema ha accedido a otra jerarquía del manual del sistema operativo, esta opcion puede ser empleada para incluirlas dentro de la salida del B<%manpath%>. Para incluir la página del manual SOnuevo utilice la opción B<-m> B<SOnuevo>.

source: The I<system> specified can be a combination of comma delimited operating system names. To include the native operating system's manual page hierarchies, the system name B<man> must be included in the argument string. This option will override the $B<SYSTEM> environment variable.
es: El I<sistema> especificado puede ser una combinación de coma delimitada de nombres del SO. Para incluir la página jerárquica del manual del SO nativo, el nombre del sistema B<man> debe ser incluido dentro de la cadena de argumento. Esta opción sobrescribirá la variable del entorno del $B<SISTEMA>.

source: If $B<MANPATH> is set, B<%manpath%> displays its value rather than determining it on the fly. If $B<MANPATH> is prefixed by a colon, then the value of the variable is appended to the list determined from the content of the configuration files. If the colon comes at the end of the value in the variable, then the determined list is appended to the content of the variable. If the value of the variable contains a double colon (B<::>), then the determined list is inserted in the middle of the value, between the two colons.
es: Si está establecido $B<MANPATH>, $B<%manpath%> enseña por pantalla su valor en vez de determinarlo en ejeción. Si $B<MANPATH> está prefijado por dos puntos, esntonces el valor de la variable es agragado a la lista determinada desde el contenido de los ficheros de configuración. Si los dos putnos vienen el final del valor en la variable, entonce la determinada lista es agragada al contenido de la variable. Si el valor de la variable contiene un dos puntos doble (B<::>), entonces la lista determinada es insertada dentro de la mitad del valor, entre el par de los dos puntos.

source: %whatis% - display one-line manual page descriptions
es: %whatis% - enseña una línea de descripciones de páginas de manuales conectadas

source: B<%whatis%> [\|B<-dlv?V>\|] [\|B<-r>\||\|B<-w>\|] [\|B<-s> I<list>\|] [\|B<-m> I<system>\|[\|,.\|.\|.\|]\|] [\|B<-M> I<path>\|] [\|B<-L> I<locale>\|] [\|B<-C> I<file>\|] I<name> \&.\|.\|.
es: B<%whatis%> [\|B<-dlv?V>\|] [\|B<-r>\||\|B<-w>\|] [\|B<-s> I<listado>\|] [\|B<-m> I<sistema>\|[\|,.\|.\|.\|]\|] [\|B<-M> I<ruta>\|] [\|B<-L> I<localización>\|] [\|B<-C> I<fichero>\|] I<nombre> \&.\|.\|.

source: Each manual page has a short description available within it. B<%whatis%> searches the manual page names and displays the manual page descriptions of any I<name> matched.
es: Cada página de manual tienen una descripción breve disponible dentro de ésta. B<%whatis%> busca nombres de página del manual y enseña la página del manual descrita de cualquier I<nombre> coincidente.

source: I<name> may contain wildcards (B<-w>) or be a regular expression (B<-r>). Using these options, it may be necessary to quote the I<name> or escape (\e) the special characters to stop the shell from interpreting them.
es: El I<nombre> quIzá contiene comodines (B<-w>) o es una expresión regular (B<-r>). Utilizando estas opciones, quizá es necesario para entrecomillar el I<nombre> o escapar (\e) los caracteres especiales para detener la shell desde interpretación de éstas.

source: B<index> databases are used during the search, and are updated by the B<%mandb%> program. Depending on your installation, this may be run by a periodic cron job, or may need to be run manually after new manual pages have been installed. To produce an old style text B<whatis> database from the relative B<index> database, issue the command:
es: B<indexa> bases de datos son empladas durante la búsqueda, y son actualizadas por el programa B<%mandb%>. Dependiendo en su instalación, esto quizá está ejecutado por una tarea cronometrada, o quizá requiere ser ejecutado manualmente páginas del manual nuevas que han sido instaladas. Para producir un texto de estilo antiguo B<que sea> base de datos desde la B<indexación> relativa a la base de datos, efectúe la orden:

source: B<%whatis% -M> I<manpath> B<-w '*' | sort E<gt>> I<manpath/whatis>
es: B<%whatis% -M> I<rutaman> B<-w '*' | sort E<gt>> I<manpath/whatis>

source: where I<manpath> is a manual page hierarchy such as I</usr/man>.
es: donde I<rutaman> es una página del manual jerárquica tal como I</usr/man>.

source: Interpret each I<name> as a pattern containing shell style wildcards. For a match to be made, an expanded I<name> must match the entire page name. This option causes B<%whatis%> to be somewhat slower due to the nature of database searches.
es: Interpreta cada I<nombre> como un patrón conteniendo comodines de estilo shell. Para una coincidencia a ser hecha, un I<nombre> expandido debe coincidir con el nombre completo de página. Esta opción causa que B<%whatis%> sea algomás lento que hacerlo naturalmente en búsqueda de base de datos.

source: %zsoelim% - satisfy .so requests in roff input
es: %zsoelim% - satisface peticioines .so en entrada roff

source: B<%zsoelim%> [\|B<-CVh>\|] [\|I<file> \&.\|.\|.\|]
es: B<%zsoelim%> [\|B<-CVh>\|] [\|I<fichero> \&.\|.\|.\|]

source: B<%zsoelim%> parses I<file> arguments, or if none are specified, its standard input for lines of the form:
es: B<%zsoelim%> interpreta I<file> argumentos, o si ninguno está especificado, su entrada común para líneas del formato:

source: B<.so> E<lt>\|I<filename>\|E<gt>
es: B<.so> E<lt>\|I<nombrefichero>\|E<gt>

source: Traditionally, B<soelim> programs were used to allow roff preprocessors to be able to preprocess the files referred to by the requests. This particular version was written to circumvent problems created by support for compressed manual pages.
es: Tradicionalmente, los programas B<soelim> fueron utilizados para permitir preprocesamientos roff para ser capaz de preprocesar los ficheros referidos apor las peticiones. Esta versión particuales fue escrita para evitar problemas creados por compatibilidad de compresión de páginas del manual.

source: This flag is available for compatibility with other B<soelim> programs. Its use is to enable .so requests followed by something other than whitespace. As this is already the default behaviour, it is ignored.
es: Esta marca está disponible para compatibilidad con otros programas B<soelim>. Utilizas esto para activar solicitudes .so seguidas por algo más que espacios en blanco. Tal como esto está ya el comportamiento predeterminado, está ignorado.

source: manpath - format of the %manpath_config_file% file
es: manpath - formato %manpath_config_file% como fichero

source: The manpath configuration file is used by the manual page utilities to assess users' manpaths at run time, to indicate which manual page hierarchies (manpaths) are to be treated as system hierarchies and to assign them directories to be used for storing cat files.
es: La configuración empleada de la ruta man del fichero para las utilidades de la página man para asegurar las rutas del manual de los usuarios, que indican cual jerárquia de la página del manual va a ser tratada como jerarquí del sistema y para asignarlas como directorios para ser utilizados para almacenar ficheros concatenados.

source: If the environment variable $B<MANPATH> is already set, the information contained within %manpath_config_file% will not override it.
es: Si la variable del entorno $B<MANPATH> ya está establecida, la información contenida dentro del %manpath_config_file% no la sobrescribirá.

source: FORMAT
es: FORMATO

source: The following field types are currently recognised:
es: Los siguientes tipos de campos son actualmente reconocidos:

source: B<#>I<\ comment>
es: B<#>I<\ comentario>

source: Blank lines or those beginning with a B<#> will be treated as comments and ignored.
es: Líneas en blanco o aquellas comenzando con un B<#> serán tratadas como comentarios e ignoradas.

source: B<MANDATORY_MANPATH>I<\ manpath_element>
es: B<MANDATORY_MANPATH>I<\ elemento_rutaman>

source: Lines of this form indicate manpaths that every automatically generated $B<MANPATH> should contain. This will typically include I</usr/man>.
es: Líneas de este formato indica a manpath que cada uno automáticamente generó $B<MANPATH> debería contener. Esto incluirá típicamente I</usr/man>.

source: Lines of this form set up $B<PATH> to $B<MANPATH> mappings. For each I<path_element> found in the user's $B<PATH>, I<manpath_element> will be added to the $B<MANPATH>.
es: Las líneas de este formulario establece enlaces $B<PATH> a $B<MANPATH>. Por cada ruta I<path_element> encontrada dentro de la ruta $B<PATH> del usuario, I<manpath_element> será añadido a la ruta $B<MANPATH>.

source: B<MANDB_MAP >I<manpath_element >\|[\| I<catpath_element> \|]
es: B<MANDB_MAP >I<rutaman_elemento >\|[\| I<rutacat_elemento> \|]

source: Lines of this form indicate which manpaths are to be treated as system manpaths, and optionally where their cat files should be stored. This field type is particularly important if B<man> is a setuid program, as (when in the system configuration file %manpath_config_file% rather than the per-user configuration file .manpath) it indicates which manual page hierarchies to access as the setuid user and which as the invoking user.
es: Líneas de este formulario indica cuales rutas del man erab para ser tratadas como rutas man del sistema, y opcionalmente donde sus ficheros cat deberían ser almacenadas. Este tipo de campo es particularmente un porgrama de id de configuración, como (cuando en el fichero de configuración del sistema %manpath_config_file% en vez que el fichero de configuración por cada usuario .manoath) indica cual página del manual jerárquica accede como el seruid del usuario y cual es invocado al usuario.

source: The system manual page hierarchies are usually those stored under I</usr> such as I</usr/man>, I</usr/local/man> and I</usr/X11R6/man>.
es: Las jerarquías de página del manual de sistema son normalmente aquellas almacenadas debajo de I</usr> tales como I</usr/man>, I</usr/local/man> y I</usr/X11R6/man>.

source: If cat pages from a particular I<manpath_element> are not to be stored or are to be stored in the traditional location, I<catpath_element> may be omitted.
es: Si las páginas concatenadas desde un elemento I<element_manpath> particular no está para ser almacenado o está para ser almacenado dentro de la ubicación tradicional, I<catpath_element> quizá sea omitido.

source: Traditional cat placement would be impossible for read only mounted manual page hierarchies and because of this it is possible to specify any valid directory hierarchy for their storage. To observe the B<Linux FSSTND> the keyword `B<FSSTND> can be used in place of an actual directory.
es: Ubicación concatenadora tradicional debería ser imposible para lectura única montada en la jerarqueía de página del manaual y porque debido a esto es posible especificar cualquier jerarquía del directorio para su almacenamento. Para observar la palabra clave B<Linux FSSTND> de B<FSSTND> puede ser empleada en el lugar de un directorio actual.

source: Unfortunately, it is necessary to specify B<all> system man tree paths, including alternate operating system paths such as I</usr/man/sun> and any B<NLS locale> paths such as I</usr/man/de_DE.88591>.
es: Desafortunadamente, es necesario especificar B<todo> árbol de rutas del sistema man, incluyendo operando alternativamente a la ruta del sistema como I</usr/man/sun> y cualquier ruta B<localización NLS> como I</usr/man/es_ES.88951>.

source: As the information is parsed line by line in the order written, it is necessary for any manpath that is a sub-hierarchy of another hierarchy to be listed first, otherwise an incorrect match will be made. An example is that I</usr/man/de_DE.88591> must come before I</usr/man>.
es: Como la información es interpretada línea a línea en el orden en que se escriben, es necesario para cualquier ruta de man que sea una sub-jerarquía de otra jerarquía para ser listada primero, en otro caso una coincidencia incorrecta será creada. Un ejemplo es que I</usr/man/de_DE.88591> debe venir antes que I</usr/man>.

source: B<DEFINE>I<\ key\ value>
es: B<DEFINIR>I<\ clave\ valor>
