Repository: tangt64/duststack-cloudstack-linux
Catalog: man-db-2.8.6.1/man/po4a/po/*.po
Languages: es

source: Equivalent to B<%apropos%>. Search the short manual page descriptions for keywords and display any matches. See B<%apropos%>(1) for details.
es: Equivalente a B<%apropos%>. Busca las descripciones cortas de la página del manual para palabras clave y enseña cualquier coincidencia. Vea B<%apropos%>(1) para detalles.

source: Search for text in all manual pages. This is a brute-force search, and is likely to take some time; if you can, you should specify a section to reduce the number of pages that need to be searched. Search terms may be simple strings (the default), or regular expressions if the B<--regex> option is used.
es: Buscar texto dentro de todas las páginas del manual. Esto es una búsqueda de fuerza bruta, y es similar a tomar algo de tiempo; si puede, debería especificar una sección para reducir el número de páginas buscadas. La búsqueda terminológica quizá sea cadenas simples (lo predeterminado), o expresiones regulares si la opción B<--regex> es utilizada.

source: Note that this searches the I<sources> of the manual pages, not the rendered text, and so may include false positives due to things like comments in source files. Searching the rendered text would be much slower.
es: Note que esta búsqueda de I<origen> de las páginas del manual, no el texto renderizado, y por lo tanto se incluyen falsos positivos debido a cosas como comentarios en ficheros del origen. Buscando el texto renderizado podría ser más lento.

source: Activate `local' mode. Format and display local manual files instead of searching through the system's manual collection. Each manual page argument will be interpreted as an nroff source file in the correct format. No cat file is produced. If '-' is listed as one of the arguments, input will be taken from stdin. When this option is not used, and man fails to find the page required, before displaying the error message, it attempts to act as if this option was supplied, using the name as a filename and looking for an exact match.
es: Activa modo `local'. Formatea y enseña ficheros de manual local en vez de buscando a través de la colección de manuales del sistema. Cada argumento de página del manaul será interpretado como un fichero fuente nroff en el formato correcto. Ningún fichero car está producido. Si '-' está listado como uno de los argumentos, entrada será tomada desde stdin. Cuando esta opción no está empleada, y falla man al encontrar la página requerida, tras enselar el mensaje de error, intentará actualiza como si esta opción fuera suministrada, utilizando el nombre como un nombre de fichero y buscando una coincidencia exacta.

source: Don't actually display the manual pages, but do print the location(s) of the source nroff files that would be formatted.
es: No enseña actualmente las páginas del manual, pero no escribir la(s) localización/es de los ficheros origen nroff que podrían ser formateadas.

source: Don't actually display the manual pages, but do print the location(s) of the cat files that would be displayed. If -w and -W are both specified, print both separated by a space.
es: No enseña actualmente las páginas del manual, pero escribe la localización de los ficheros cat que podrían ser enseñados. Si ambos -w y -W son especificados, escribe ambos separados por un espacio.

source: This option is not for general use and should only be used by the B<%catman%> program.
es: Esta opción no es para utilización general y deberían solo ser empleadas por el programa B<%catman%>.

source: B<-R\ >I<encoding>,\ B<--recode>=I<encoding>
es: B<-R\ >I<codificación>,\ B<--recode>=I<codificación>

source: Instead of formatting the manual page in the usual way, output its source converted to the specified I<encoding>. If you already know the encoding of the source file, you can also use B<%manconv%>(1) directly. However, this option allows you to convert several manual pages to a single encoding without having to explicitly state the encoding of each, provided that they were already installed in a structure similar to a manual page hierarchy.
es: En vaz de formatear la página del manual dentro de la forma usual, saca su fuente convertida al la I<codificación> especificada. Si ya sabe la codificación del fichero fuente, puede también utilizar B<%manconv%> (1) directamente. Sin embargo, esta opción permite convertir varias páginas de manual a una codificación única sin tener que explicitar estado la codificación de cada una, proporcionando que ya fueron instalados dentro de una estructura similar a una página jerarquizada del manual.

source: Finding manual pages
es: Encontrando páginas del manual

source: If this system has access to other operating system's manual pages, they can be accessed using this option. To search for a manual page from NewOS's manual page collection, use the option B<-m> B<NewOS>.
es: Si este sistema tiene acceso a otras páginas del manual de otro sistema operativo, pueden ser accedidos utilizando esta opción. Para buscar una página del manual desde la colección de págnas del manual del SONuevo, utilice la opción B<-m> B<SONuevo>.

source: The I<system> specified can be a combination of comma delimited operating system names. To include a search of the native operating system's manual pages, include the system name B<man> in the argument string. This option will override the $B<SYSTEM> environment variable.
es: El I<sistema> especificado puede ser una combinación de comas delimitados de nombres del sistema operativo. Para incluir una búsqueda de las páginas del manual del sistema operativo nativo, incluya el nombre del sistema B<man> en la cadena argumentarioa. Esta opción sobrescribirá la variable del entorno del $B<SISTEMA>.

source: Specify an alternate manpath to use. By default, B<%man%> uses B<%manpath%> derived code to determine the path to search. This option overrides the $B<MANPATH> environment variable and causes option B<-m> to be ignored.
es: Especifica una ruta de man alternativa para utilizar. Por defecto, B<%man%> utiliza código B<%manpath> derivado para determinar la ruta a buscar. Esta opción sobrescribe la variable del entorno $B<MANPATH> y causa que la opción B<-m> sea ignorada.

source: A path specified as a manpath must be the root of a manual page hierarchy structured into sections as described in the man-db manual (under "The manual page system"). To view manual pages outside such hierarchies, see the B<-l> option.
es: Una ruta especifica como un manpath debe ser la raíz de una jerarguía de página man estructurada en decciones como describía en el manual de man-db (debajo de «El sistema de páginas del manual»). Para ver páginas del manual como jerarquías, vea la opción B<-l>.

source: List is a colon- or comma-separated list of `order specific' manual sections to search. This option overrides the $B<MANSECT> environment variable. (The B<-s> spelling is for compatibility with System V.)
es: Listado es una lista de dos puntos o coma separada de «mandato especifico» de sección del manaula para buscar. Esta opción sobrescribe la variable de entorno $B<MANSECT>. (La ortografía B<-s> está para compatibilizar con System V.)

source: B<-e\ >I<sub-extension>,\ B<--extension=>I<sub-extension>
es: B<-e\ >I<sub-extensión>,\ B<--extension=>I<sub-extensión>

source: Ignore case when searching for manual pages. This is the default.
es: Ignora mayúsculas cuando busque páginas del manual. Esto es lo predeterminado.

source: Search for manual pages case-sensitively.
es: Busca páginas distinguiendo mayúsculas.

source: Show all pages with any part of either their names or their descriptions matching each I<page> argument as a regular expression, as with B<apropos>(1). Since there is usually no reasonable way to pick a "best" page when searching for a regular expression, this option implies B<-a>.
es: Muestra todas las páginas con cualquier parte de cada uno de sus nombres de sus descripciones coincidentes por cada argumento I<paginado> como una expresión regular. tal como B<apropos>(1). Desde que hay usualmente ninguna forma razonable para tomar una «mejor» página cuando busque para una expresión regular, esta opción implica B<-a>.

source: Show all pages with any part of either their names or their descriptions matching each I<page> argument using shell-style wildcards, as with B<apropos>(1) B<--wildcard>. The I<page> argument must match the entire name or description, or match on word boundaries in the description. Since there is usually no reasonable way to pick a "best" page when searching for a wildcard, this option implies B<-a>.
es: Muestra todas las páginas con cualquier parte de cada uno de sus nombres o sus descripciones coincidentes de cada I<página> de argumento utilizando comodines de estilo shell, como con B<apropos>(1) B<--wildcard>. El argumento I<página> debe coincidir con el nombre completo o descricón, o coincide en finales de palabras dentro de la descripción. Desde que hay usualmente ninguna forma de escoger una página «mejor» cuando busque un comodín, esta opción implica B<-a>.

source: If the B<--regex> or B<--wildcard> option is used, match only page names, not page descriptions, as with B<whatis>(1). Otherwise, no effect.
es: Si la opción B<--regex> o B<--wildcard> está utilizada, coincide solo los nombres de página, no las descripciones de la página, tal con B<whatis>(1). En otras formas, sin efecto.

source: By default, B<%man%> will exit after displaying the most suitable manual page it finds. Using this option forces B<%man%> to display all the manual pages with names that match the search criteria.
es: Predeterminado, B<%man%> terminará tras enseñar la página del manual más capaz que pudo encontrar. Normalmente esta opción fuerza B<%man%> para enseñar todas las páginas del manual con nombres que coincidan con este criterio buscado.

source: This option causes B<%man%> to perform an `inode level' consistency check on its database caches to ensure that they are an accurate representation of the filesystem. It will only have a useful effect if B<%man%> is installed with the setuid bit set.
es: Esta opción causa que B<%man%> realice una comprobación de consistencia de nivel inodo' en su base de datos caché para asegurar que está representación adecuada en el sistema de fichero. Solo tiene un efecto útil si B<%man%> está instalado con el conjunto de bit setid.

source: By default, B<%man%> will try to interpret pairs of manual page names given on the command line as equivalent to a single manual page name containing a hyphen or an underscore. This supports the common pattern of programs that implement a number of subcommands, allowing them to provide manual pages for each that can be accessed using similar syntax as would be used to invoke the subcommands themselves. For example:
es: Por omisión, B<%man%> intentará a interpretar pares de nombres de páginas del manualdadas en la línea de órdenes como equivalente a una página de manual simple conteniendo un guión o un subrayado. Esto soporta el patrón común de programas que implementan un número de subórdenes, permitiendo proporcionar páginas de manual por cada una que pueda ser accedida utilizando sintaxis similar como podrían ser utilizado para invocar al subórdenes ellas mismas. Por ejemplo:

source: To disable this behaviour, use the B<--no-subpages> option.
es: Para desactivar este comportamiento, utilice la opción B<--no-subpages>.

source: Controlling formatted output
es: Controlando salida formateada

source: Specify which output pager to use. By default, B<%man%> uses B<%pager%>, falling back to B<%cat%> if B<%pager%> is not found or is not executable. This option overrides the $B<MANPAGER> environment variable, which in turn overrides the $B<PAGER> environment variable. It is not used in conjunction with B<-f> or B<-k>.
es: Específicamente cual salida del paginador a emplear. Por defecto, B<%man%> utiliza B<%pager%>, volviendo si B<%pager%> no se encuentra o no es ejecutable. Esta opción sobreescribe la variable de entorno $B<MANPAGER>, la cual al devolver sobrescribe la variable de entorno $B<PAGER>. Si no se emplea ésto en conjunción con B<-f> o B<-k>.

source: B<\ Manual page>I<\ name>B<(>I<sec>B<)>B<\ line>I<\ x>
es: B<\ Página del manual>I<\ nombre>B<(>I<sec>B<)>B<\ línea>I<\ x>

source: where I<name> denotes the manual page name, I<sec> denotes the section it was found under and I<x> the current line number. This is achieved by using the $B<LESS> environment variable.
es: donde I<nombre> denota el nombre de la página del manual, I<sec> denota la sección fue encontrada debajo y I<x> el número de línea actual. Esto está conseguido utilizando la variable del entorno $B<LESS>.

source: B<\e\ Manual\e\ page\e\ \e$MAN_PN\e\ ?ltline\e\ %lt?L/%L.:>
es: B<\e\ Página\e\ del\e\ Manual\e \e$MAN_PN\e\ ?ltline\e\ %lt?L/%L.:>

source: B<byte\e\ %bB?s/%s..?\e\ (END):?pB\e\ %pB\e\e%..>
es: B<byte\e\ %bB?s/%s..?\e\ (FINAL):?pB\e\ %pB\e\e%..>

source: B<(press h for help or q to quit)>
es: B<(pulse h para ayuda o q para salir)>

source: Description
es: Descripción

source: continuation hyphen
es: continuación guión

source: bullet (middle dot)
es: viñeta (punto medio)

source: acute accent
es: acento

source: multiplication sign
es: signo multiplicador

source: If the I<latin1> column displays correctly, your terminal may be set up for I<latin1> characters and this option is not necessary. If the I<latin1> and I<ascii> columns are identical, you are reading this page using this option or B<%man%> did not format this page using the I<latin1> device description. If the I<latin1> column is missing or corrupt, you may need to view manual pages with this option.
es: Si la columna I<latin1> enseña correctamente, su terminal quizá está configurada para caracteres I<latin1> y esta opción no es necesaria. Si las columna de formato I<latin1> y I<ascii> son idénticas, está leyendo esta página utilizando esta opción o B<%man%> no formateó esta página utilizando la descripción I<latin1> del dispositivo. Si la columna I<latin1> falta o está corrupta, quizá necesita ver páginas del manual con esta opción.

source: This option is ignored when using options B<-t>, B<-H>, B<-T>, or B<-Z> and may be useless for B<nroff> other than B<GNU's>.
es: Esta opción es ignorada cuando utilice opciones B<-t>, B<-H>, B<-T>, o B<-Z> y quizá son poco útiles para B<nroff> otras que B<GNU>.

source: B<-E\ >I<encoding>,\ B<--encoding>=I<encoding>
es: B<-E\ >I<codificación>,\ B<--encoding>=I<codificación>

source: Generate output for a character encoding other than the default. For backward compatibility, I<encoding> may be an B<nroff> device such as B<ascii>, B<latin1>, or B<utf8> as well as a true character encoding such as B<UTF-8>.
es: Genera salida para una codificación de caracteres distinta que la predeterminada. Para compatibilidad hacia atrás, la I<codificación> quizá es un dispositivo B<nroff> como un B<ascii>, B<latin1>, o B<utf8> tan buen codificación como un B<UTF-8>.

source: Normally, B<nroff> will automatically hyphenate text at line breaks even in words that do not contain hyphens, if it is necessary to do so to lay out words on a line without excessive spacing. This option disables automatic hyphenation, so words will only be hyphenated if they already contain hyphens.
es: Normalmente, B<nroff> automáticamente separará texto con guiones cuando la línea se parta incluso en palabras que no contengan guiones, si esto es necesario para hacerlo de tal forma que ninguna palabra se quede en una línea sin espaciado excesivo. Esta opción desactiva guiones automáticos, por lo que las palabras solo serán separadas si ya tienen guiones.

source: If you are writing a manual page and simply want to prevent B<nroff> from hyphenating a word at an inappropriate point, do not use this option, but consult the B<nroff> documentation instead; for instance, you can put "\e%" inside a word to indicate that it may be hyphenated at that point, or put "\e%" at the start of a word to prevent it from being hyphenated.
es: Si está escribiendo una página de manual y simplemente quiere prevenir B<nroff> desde guion de una palabra que es un punto inapropiado, no utilice esta opción, pero consulte la documentación B<nroff> en su lugar; para probar, puede poner "\e%" dentro de una palabra para indicar que quizá puede entregionarse en ese punto, o ponga "\e%" el principio de una palabra para prevenir desde donde sea entreguionado.

source: Normally, B<nroff> will automatically justify text to both margins. This option disables full justification, leaving justified only to the left margin, sometimes called "ragged-right" text.
es: Normalmente, B<nroff> automáticamente justificará texto a ambos márgenes. Esta opción desactiva justificación completa, dejando justificados solo al margen izquierdo, algunas veces llamado texto «arrastrado a la derecha».

source: B<-p\ >I<string>,\ B<--preprocessor=>I<string>
es: B<-p\ >I<cadena>,\ B<--preprocessor=>I<cadena>

source: Specify the sequence of preprocessors to run before B<nroff> or B<troff>/B<groff>. Not all installations will have a full set of preprocessors. Some of the preprocessors and the letters used to designate them are: B<eqn> (B<e>), B<grap> (B<g>), B<pic> (B<p>), B<tbl> (B<t>), B<vgrind> (B<v>), B<refer> (B<r>). This option overrides the $B<MANROFFSEQ> environment variable. B<%zsoelim%> is always run as the very first preprocessor.
es: Especifica la secuencia de preprocesadores para ejecutar antes que B<nroff> o B<troff>/B<groff>. No todas las instanlaciones tendrán un conjunto completo de proprocesadores. Algunos de los preprocesadores y las letras utilizadas para designarlos son: B<eqn> (B<e>), B<grap> (B<g>), B<pic> (B<p>), B<tbl> (B<t>), B<vgrind> (B<v>), B<refer> (B<r>). Esta opción sobrescribe la variable de entorno $B<MANROFFSEQ>. B<%zsoelim%> siempre es ejecutado como el primer preprocesador.

source: Use I<%troff%> to format the manual page to stdout. This option is not required in conjunction with B<-H>, B<-T>, or B<-Z>.
es: Utilice I<%troll%> para dar formato a la página del manual a salida común. Esta opción no está requerida en conjunción con B<-H>, B<-T>, o B<-Z>.

source: B<-T>[I<device\/>], B<--troff-device>[=I<device\/>]
es: B<-T>[I<dispositivo\/>], B<--troff-device>[=I<dispositivo\/>]

source: This option is used to change B<groff> (or possibly B<troff's>) output to be suitable for a device other than the default. It implies B<-t>. Examples (provided with Groff-1.17) include B<dvi>, B<latin1>, B<ps>, B<utf8>, B<X75> and B<X100>.
es: Esta opción está empleada para modificar B<groff> (o posiblemente B<troff>) externo para ser capaz para un dispositivo distinto que lo predeterminado. Implica B<-t>. Ejemplos (proporcionados con Groff-1.17) incluye B<dvi>, B<latin1>, B<ps>, B<utf8>, B<X75> y B<X100>.

source: B<-H>[I<browser\/>], B<--html>[=I<browser\/>]
es: B<-H>[I<explorador\/>], B<--html>[=I<explorador\/>]

source: This option displays the output of B<groff> in a graphical window using the B<gxditview> program. The I<dpi> (dots per inch) may be 75, 75-12, 100, or 100-12, defaulting to 75; the -12 variants use a 12-point base font. This option implies B<-T> with the X75, X75-12, X100, or X100-12 device respectively.
es: La opción enseña la salida de B<groff> dentro de una ventana gráfica utilizando el programa B<gxditvew>. El I<ppp> (puntos por pulgada) puede ser 75, 75-12, 100, o 100-12, por defecto a 75; la variante -12 utiliza una tipografía base de 12 puntos. Esta opción implica B<-T> con los respectivos dispositivos X75, X75-12, X100 o X11-12.

source: B<groff> will run B<troff> and then use an appropriate post-processor to produce output suitable for the chosen device. If I<%troff%> is B<groff>, this option is passed to B<groff> and will suppress the use of a post-processor. It implies B<-t>.
es: B<groff> ejecutará B<troff> y después utilizará un apropiado post procesador para producir salida capaz para el dispositivo elegido. Si I<%troff%> es B<groff>, esta opción es pasada a B<groff> y suprimirá el uso de un post-procesamiento. Implica B<-t>.

source: Getting help
es: Obtener ayuda

source: A child process returned a non-zero exit status.
es: Un subproceso devolvió un estado de salida distinta de cero.

source: At least one of the pages/files/keywords didn't exist or wasn't matched.
es: Al menos una de las páginas/ficheros/palabras_clave no existió o fue coincidido.

source: If $B<MANPATH> is set, its value is used as the path to search for manual pages.
es: Si se establece $B<MANPATH>, su valor es empleado como la ruta para buscar páginas del manual.

source: The contents of $B<MANROFFOPT> are added to the command line every time B<man> invokes the formatter (B<nroff>, B<troff>, or B<groff>).
es: Los contenidos de $B<MANROFFOPT> son añadidos a la línea mandatoria cada vez que B<man> invoca el formateador (B<nroff>, B<groff>).

source: If $B<MANROFFSEQ> is set, its value is used to determine the set of preprocessors to pass each manual page through. The default preprocessor list is system dependent.
es: Si $B<MANROFFSEQ> está establecido, su valor es empleado para determinar preprocesadores para pasar cada página del manual a traés. La lista de preprocesados predeterminados es dependiente del sistema.

source: If $B<MANSECT> is set, its value is a colon-delimited list of sections and it is used to determine which manual sections to search and in what order. The default is "%sections%", unless overridden by the B<SECTION> directive in I<%manpath_config_file%>.
es: Si $B<MANSECT> está establecido, su valor es para un listado de sectiones delimitada por dos puntos y se emplea para determinar cuales secciones del manual a buscar y en cuál orden. Lo predeterminado es "%sections%", a no ser sobrescrito por la directiva B<SECCIÓN> en I<%manpath_config_file%>.

source: If $B<MANPAGER> or $B<PAGER> is set ($B<MANPAGER> is used in preference), its value is used as the name of the program used to display the manual page. By default, B<%pager%> is used, falling back to B<%cat%> if B<%pager%> is not found or is not executable.
es: Si $B<MANPAGER> o $B<PAGER> está activo ($B<MANPAGER> empleado en prederencia), su valor es empleado como el nombre del programa utilizado para mostrar la página del manual. Por defecto, B<%pager%> es empleado, volviendo al B<%cat%> si B<%pager%> no se ha encontrado o no es ejecutable.

source: If $B<MANLESS> is set, its value will be used as the default prompt string for the B<less> pager, as if it had been passed using the B<-r> option (so any occurrences of the text B<$MAN_PN> will be expanded in the same way). For example, if you want to set the prompt string unconditionally to \(lqmy prompt string\(rq, set $B<MANLESS> to \(oqB<-Psmy\ prompt\ string>\(cq. Using the B<-r> option overrides this environment variable.
es: Si está establecido $B<MANLESS>, su valor será empleado como la cadena solicitada para el paginador B<less>, tal como se ha pasado utilizando la opción B<-r> (por lo que cualquier ocurrencia del texto B<$MAN_PN> será expandido dentro de la misma manera). Por ejemplo, si quiere establecer la cadena solicitada incondicionalmente a \(lqmy prompt string\(rq, estabece $B<MANLESS> to \(oqB<-Psmy\ cadena solicitada>\(cq. Utilizando la opción B<-r> sobrepone esta variable de entorno.
