Repository: tangt64/duststack-cloudstack-linux
Catalog: man-db-2.8.6.1/man/po4a/po/*.po
Languages: es

source: Lines of this form define miscellaneous configuration variables; see the default configuration file for those variables used by the manual pager utilities. They include default paths to various programs (such as I<grep> and I<tbl>), and default sets of arguments to those programs.
es: Líneas de este formato define configuración adicional variable,; vea la configuración predeterminada para aquellas variables utilizadas para las utilidades del paginador manual. Estas incluyen rutas a varios programas (tales como I<grep> y I<tbl>), y connjunto predefinido en argumentos a dichos programas.

source: B<SECTION> I<section> .\|.\|.
es: B<SECCIÓN> I<sección> .\|.\|.

source: Lines of this form define the order in which manual sections should be searched. If there are no B<SECTION> directives in the configuration file, the default is:
es: Líneas de este formulario define el orden en el cual las secciones del manual deberían ser buscadas. Si no hay B<SECCIÓN> directivas en el ficheor de configuración, lo predeterminado es:

source: If multiple B<SECTION> directives are given, their section lists will be concatenated.
es: Si hay dadas múltiples directivas de B<SECTION>, su listados de sección serán concatenadas.

source: If a particular extension is not in this list (say, 1mh) it will be displayed with the rest of the section it belongs to. The effect of this is that you only need to explicitly list extensions if you want to force a particular order. Sections with extensions should usually be adjacent to their main section (e.g. "1 1mh 8 ...").
es: Si una extensión particular no está en esta lista (digamos, 1mh) será mostrado con el resto de la sección que pertenece. El efecto de esto es que solo necesita explícitamente listar extensiones si quiere forzar una ordenación particular. Las secciones con extensiones deberían ser usualmente adyacentes a su sección principal (p.e. «1 1mh 8 ...»).

source: B<SECTIONS> is accepted as an alternative name for this directive.
es: B<SECCIÓN> es aceptada como un nombre alternativo para esta directiva.

source: If the terminal width is less than I<width>, cat pages will not be created (if missing) or displayed. The default is 80.
es: Si la anchura del terminal es menor que I<anchura>, las páginas concatenadas no serán creadas (si faltan) o enseñadas. Lo predeterminado es 80.

source: B<MAXCATWIDTH>I<\ width>
es: B<ANCHOCORTEMAX>I<\ width>

source: If the terminal width is greater than I<width>, cat pages will not be created (if missing) or displayed. The default is 80.
es: Si la ancura del terminal es mayor que I<anchura>, concatena páginas no será creada (si falta) o enseñada. Lo predeterminado es 80.

source: B<CATWIDTH>I<\ width>
es: B<ANCHURA>I<\ width>

source: If I<width> is non-zero, cat pages will always be formatted for a terminal of the given width, regardless of the width of the terminal actually being used. This should generally be within the range set by B<MINCATWIDTH> and B<MAXCATWIDTH>.
es: Si I<anchura> es distinta de cero, páginas cat siempre serán formateada para un terminal de la anchura indicada, a no ser que la anchura del terminal actualmente sea utilizada. Esto normalmente debería estar entre el rango establecido por B<MINCATWIDTH> y B<MAXCATWIDTH>.

source: This flag prevents B<%man%>(1) from creating cat pages automatically.
es: Esta marca previene a B<%man%>(1) desde la creación de páginas car automáticamente.

source: BUGS
es: DEFECTOS

source: Unless the rules above are followed and observed precisely, the manual pager utilities will not function as desired. The rules are overly complicated.
es: A no ser que las reglas encima sean seguidas y observadas precisamente, las utilidades del paginador del manual no funcionarán coo deseábamos. Las reglas sobrepasan complicadas.

source: accessdb - dumps the content of a man-db database in a human readable format
es: accessdb - vuelca el contenido de una base de datos man-db en un formato leíble por la personas

source: B</usr/sbin/accessdb> [\|B<-d?V>\|] [I<E<lt>index-fileE<gt>>]
es: B</usr/sbin/accessdb> [\|B<-d?V>\|] [I<E<lt>ficher-indizadoE<gt>>]

source: B<accessdb> will output the data contained within a man-db database in a human readable form. By default, it will dump the data from B</var/cache/man/index.E<lt>db-typeE<gt>,> where E<lt>db-typeE<gt> is dependent on the database library in use.
es: B<accessdb> sacará los datos contenidos dentro de una BD man-db en un formato leíble por humano. Por defecto, volará los datos desde B</var/cache/man/index.E<lt>db-tipeE<gt>>, donde E<lt>db-typeE<gt> es dependiente en la biblioteca de BD utilizada.

source: Supplying an argument to accessdb will override this default.
es: Suministre un argumento para accessdb sobrescribirá esto por defecto.

source: %catman% - create or update the pre-formatted manual pages
es: %catman% - crea o actualiza las páginas manuales preformateadas

source: B<%catman%> [\|B<-d?V>\|] [\|B<-M> I<path>\|] [\|B<-C> I<file>\|] [\|I<section>\|] \&.\|.\|.
es: B<%catman%> [\|B<-d?V>\|] [\|B<-M> I<ruta>\|] [\|B<-C> I<fichero>\|] [\|I<sección>\|] \&.\|.\|.

source: B<%catman%> is used to create an up to date set of pre-formatted manual pages known as cat pages. Cat pages are generally much faster to display than the original manual pages, but require extra storage space. The decision to support cat pages is that of the local administrator, who must provide suitable directories to contain them.
es: B<%catman%> se utiliza para crear un conjunto actual de páginas preformateadas del manual conocidas como páginas cat. Páginas cat son generadalmente mucho más rápidas para enseñar que las páginas del manaul original,pero requier espacio de almacenaje adicional . La decisión para apoyar páginas cat es que del administrador local, el cual debe proporcionar directorios capaces de contenerlos.

source: The options available to B<%catman%> are the manual page hierarchies and sections to pre-format. The default hierarchies are those specified as system hierarchies in the man-db configuration file, and the default sections are either the colon-delimited contents of the environment variable $B<MANSECT> or the standard set compiled into B<%man%> if $B<MANSECT> is undefined. Supplying B<%catman%> with a set of whitespace-delimited section names will override both of the above.
es: Las opciones disponibles a B<%carman%> son las jerarquías y secciones de la página del manual para pre-formatear. Las jerarquías predeterminadas son aquellas especificadas dentro de fichero de configuración de la man-db, y las secciones predeterminadas son o los contenidos con dos puntos delimitados de la variable de entorno $B<MANSECT> o el conjunto común compilado dentro de B<%man%> si $B<MANSECT> está indefinido. Proporcionando B<%catman%> con un conjunto de nombres de seccción con espacios en blanco delimitados sobrescribiendo ambos en el superior.

source: B<%catman%> makes use of the B<index> database cache associated with each hierarchy to determine which files need to be formatted.
es: B<%catman%> utiliza usuario de la caché de BD B<indizado> asociado con cada jerarquía para determinar cual fichero requiere ser formateado.

source: Specify an alternate colon-delimited manual page hierarchy search path. By default, this is all paths indicated as system hierarchies in the man-db configuration file.
es: Especifica una alternativa delimitada por los dos puntos de la ruta de búsqueda jerárquica del manual. Quizá, por defecto esto es todas las rutas indicadas como jerarquía del distema dentro del fichero de configuración de la base de datos man-db.

source: An alternate or FSSTND compliant global I<index> database cache.
es: Una alternativa o FSSTND complaciente global I<index> caché de base de datos.

source: %mandb% - create or update the manual page index caches
es: %mandb% - crea o actualiza cachés del indexado de páginas del manual

source: B<%mandb%> [\|B<-dqsut>\|] [\|B<-C> I<file>\|] B<-f> I<filename>\ .\|.\|.
es: B<%mandb%> [\|B<-dqsut>\|] [\|B<-C> I<fichero>\|] B<-f> I<nombrefichero>\ .\|.\|.

source: B<%mandb%> is used to initialise or manually update B<index> database caches that are usually maintained by B<%man%>. The caches contain information relevant to the current state of the manual page system and the information stored within them is used by the man-db utilities to enhance their speed and functionality.
es: B<%mandb%> se utiliza para inicializar o manualmente actualizar cachés B<indizadas> de base de datos que estén normalmente mantenidas por B<%man%>. Las cachés contienen información para el estado actual sistema de paginado manual y la información almacenada dentro de es utilizado por man-db para mejorar su velocidad y funcionalidad.

source: When creating or updating an B<index>, B<%mandb%> will warn of bad ROFF .so requests, bogus manual page filenames and manual pages from which the B<whatis> cannot be parsed.
es: Cuando crea o actualiza un B<índice>, B<%mandb%> advertirá acerca de malas peticiones .so ROFF, nombres de ficheros del manual ambiguos y páginas del manual desde la cual la B<whatis> no puede ser interpretado.

source: Supplying B<%mandb%> with an optional colon-delimited path will override the internal system manual page hierarchy search path, determined from information found within the man-db configuration file.
es: Suministrando B<%mandb%> con una ruta opcional separada por dos puntos sobrescibirá la página del manual del sistema interna de ruta de jerarquía de búsqueda, determinada desde la información encontrada dentro del fichero de configuración de man-db.

source: DATABASE CACHES
es: CACHÉS DE BASE DE DATOS

source: B<%mandb%> can be compiled with support for any one of the following database types.
es: B<%mandb%> puede ser compilado con compatible para cualquier otro tipo de base de datos siguiente.

source: Name
es: Nombre

source: Type
es: Tipo

source: Async
es: Asíncrono

source: Filename
es: Nombre del fichero

source: Berkeley db
es: DB Berkeley

source: Binary tree
es: Árbol binario

source: Yes
es: Sí

source: Hashed
es: Firmado Hash

source: I<index.(dir|pag)>
es: I<index.(dir|pág)>

source: Those database types that support asynchronous updates provide enhanced speed at the cost of possible corruption in the event of unusual termination. In an unusual case where this has occurred, it may be necessary to rerun B<%mandb%> with the B<-c> option to re-create the databases from scratch.
es: Aquellos tipos de BD que son compatibles asíncronamente actualizaciones proporciona velocidad mejorada con el coste de posible corrupción en el evento de terminaciones no usuales. En un caso inusual donde esta ha ocurrido, quizá es necesarior reejecutar B<%nandb%> con la opción B<-c> para recrear la base de datos desde lo que queda.

source: Produce no warnings.
es: Producir sin advertencias.

source: Do not spend time looking for or adding information to the databases regarding stray cats.
es: No pierda tiempo buscando o añadiendo información a la BD con respecto a los gatos callejeros.

source: Do not spend time checking for deleted manual pages and purging them from the databases.
es: No pierda tiempo comprobando para páginas del manual borradas y purgándolas desde la base de datos.

source: By default, B<%mandb%> will try to update any previously created databases. If a database does not exist, it will create it. This option forces B<%mandb%> to delete previous databases and re-create them from scratch, and implies B<--no-purge.> This may be necessary if a database becomes corrupt or if a new database storage scheme is introduced in the future.
es: Por defecto, B<%mandb%> intentará actualizar cualquier base de datos anteriormente creada. Si una bd no existe, la creará. Esta opción fuerza B<%mandb%> para borrar bases de datos anteriores y re-crearlas desde cero, e implica sin purgar B<--no-purge.>. Esto quizá es necesario su una base de datos se corrompe o si un esquema de almacén de base de datos es introducido en el futuro.

source: Create user databases only, even with write permissions necessary to create system databases.
es: Crea una base de datos única, incluso con permisos de escritura necesariamente para crear bases de datos del sistema.

source: Perform correctness checks on manual pages in the hierarchy search path. With this option, B<%mandb%> will not alter existing databases.
es: Realiza comprobaciones de correcciones en páginas del manual dentro de la jerarquía de ruta de búsqueda. Con esta opción, B<%mandb%> no alterarán la base de datos existente.

source: Update only the entries for the given filename. This option is not for general use; it is used internally by B<%man%> when it has been compiled with the B<MAN_DB_UPDATES> option and finds that a page is out of date. It implies B<-p> and disables B<-c> and B<-s>.
es: Actualiza solo los asientos para el nombre del fichero dado. Esta opción no está para uso común, está empleado internamente por B<%man%> cuando ha sido compilado con la opción B<MAN_DB_UPDATES> y encuentra que una página está fuera de dfecha. Implica B<-p> y desactiva B<-c> y B<-s>.

source: Show the usage message, then exit.
es: Muestra este mensaje de utilización, después termina.

source: Show the version, then exit.
es: Muestra la versión, después finaliza.

source: Usage, syntax, or configuration file error.
es: Utilización, sintaxis, o configuración errónea del fichero.

source: A child process failed.
es: Un subproceso fallaba.

source: DIAGNOSTICS
es: DIAGNÓSTICOS

source: The following warning messages can be emitted during database building.
es: El siguiente mensaje de advertencia puede ser emitido durante construcción de base de datos.

source: B<E<lt>filenameE<gt>: whatis parse for page(sec) failed>
es: B<E<lt>nombre de ficheroE<gt>: whatis interpreta para paginado(sec) fallado>

source: An attempt to extract whatis line(s) from the given E<lt>filenameE<gt> failed. This is usually due to a poorly written manual page, but if many such messages are emitted it is likely that the system contains non-standard manual pages which are incompatible with the man-db whatis parser. See the B<WHATIS PARSING> section in B<lexgrog>(1) for more information.
es: Un intento para extraer que hau en la linea(s) desde el dado E<lt>nombre de ficheroE<gt> fallado. Esto es hecho usualmente para un manual escrito pobre, pero si muchos mensages dados son emitidos es como si el sistema conteniesnen manual no estandarizado lo cual es incompatible con la BD man-db que interpreta. Vea la sección B<QUÉ ES INTERPRETAR> en B<lexgrog>(1) para más información.

source: B<E<lt>filenameE<gt>: is a dangling symlink>
es: B<E<lt>nombre de ficheroE<gt>: es un enlace simbólico>

source: E<lt>filenameE<gt> does not exist but is referenced by a symbolic link. Further diagnostics are usually emitted to identify the E<lt>filenameE<gt> of the offending link.
es: E<lt>nombre de ficheroE<gt> no existe pero está referenciado por un enlace simbólico. Para más diagnósticos emitidos usualmente para identificar el E<lt>nombre de ficheroE<gt> del enlace ofendido.

source: B<E<lt>filenameE<gt>: bad symlink or ROFF `.so' request>
es: B<E<lt>nombreficheroE<gt>: equivocado enlace simbólico o petición ROFF `.so'>

source: E<lt>filenameE<gt> is either a symbolic link to, or contains a ROFF include request to, a non existent file.
es: E<lt>nombre-de-ficheroE<gt> es o bien un enlace simbólico, o contiene una petición ROFF de destino incluido, un fichero no existente.

source: B<E<lt>filenameE<gt>: ignoring bogus filename>
es: B<E<lt>nombreficheroE<gt>: ignorando nombre de fichero fingido>

source: The E<lt>filenameE<gt> may or may not be a valid manual page but its name is invalid. This is usually due to a manual page with sectional extension E<lt>xE<gt> being put in manual page section E<lt>yE<gt>.
es: El E<lt>nombreficheroE<gt> quizá puede o no puede ser una página del manual válida pero su nombre es inválido. Esto usualmente es debido a una página del manual con extensión seccional E<lt>xE<gt> que está puesta en la sección de la página del manual E<lt>yE<gt>.

source: B<E<lt>filename_maskE<gt>: competing extensions>
es: B<E<lt>máscara_nombreficheroE<gt>: completando extensiones>

source: The wildcard E<lt>filename_maskE<gt> is not unique. This is usually caused by the existence of both a compressed and uncompressed version of the same manual page. All but the most recent are ignored.
es: El comodín E<lt>nombrefichero_máscaraE<gt> no es único, Esto es causado normalmente por la existencia de ambas versiones una comprimido y otra descomprimida de la misma página del manual. Todos excepto la más reciente son ignoradas.

source: Older locations for the database cache included:
es: Localizaciones anteriores para el caché de la BD incluidas:

source: The B<WHATIS PARSING> section formerly in this manual page is now part of B<lexgrog>(1).
es: La sección B<CUAL INTERPRETE> formalmente dentro de esta página del manual ahora es parte de B<lexgrog>(1).
