Repository: tangt64/duststack-cloudstack-linux
Catalog: man-db-2.8.6.1/man/po4a/po/*.po
Languages: es

source: B<%man%> B<-w>\||\|B<-W> [\|B<-C> I<file>\|] [\|B<-d>\|] [\|B<-D>\|] I<page> \&.\|.\|.\&
es: B<%man%> B<-w>\||\|B<-W> [\|B<-C> I<fichero>\|] [\|B<-d>\|] [\|B<-D>\|] I<página> \&.\|.\|.\&

source: B<%man%> B<-c> [\|B<-C> I<file>\|] [\|B<-d>\|] [\|B<-D>\|] I<page> \&.\|.\|.\&
es: B<%man%> B<-c> [\|B<-C> I<fichero>\|] [\|B<-d>\|] [\|B<-D>\|] I<página> \&.\|.\|.\&

source: B<%man%> [\|B<-?V>\|]
es: R<%man%> [\|R<-?V>\|]

source: B<%man%> is the system's manual pager. Each I<page> argument given to B<%man%> is normally the name of a program, utility or function. The I<manual page> associated with each of these arguments is then found and displayed. A I<section>, if provided, will direct B<%man%> to look only in that I<section> of the manual. The default action is to search in all of the available I<sections> following a pre-defined order ("%sections%" by default, unless overridden by the B<SECTION> directive in I<%manpath_config_file%>), and to show only the first I<page> found, even if I<page> exists in several I<sections>.
es: B<%man%> es la página manual del sistema. Cada argumento de I<página> argumento dado a B<%man%> normalmente es el nombre de un programa, utilidad o función. La I<página del manual> asociada con cada de estos argumentos está encontrado y enseñado. Una I<section>, si proporcionó, B<%man%> dirigido para mirar solo en esa I<sección> del manual. La operación predeterminada es buscar en todoas las I<secciones> disponibles seguidas de un orden predefinido ("%sections%" por defecto, a no ser que sobrescriba por la B<SECCIÓN> directiva en I<%manpath_config_file%>), y para mostrar solo la primera I<página> encontrada, incluso si la I<página> existe dentro de varias I<secciones>.

source: The table below shows the I<section> numbers of the manual followed by the types of pages they contain.
es: La distribución inferior muestra los números de I<sección> del manual seguidos por el tipo de página que contiene.

source: Executable programs or shell commands
es: Programa ejecutable o mandatos del shell

source: System calls (functions provided by the kernel)
es: Llamadas del sistema (funciones proporcionados por el núcleo)

source: Library calls (functions within program libraries)
es: Llamadas a biblioteca (funciones dentro de bibliotecas de programa)

source: Special files (usually found in I</dev\/>)
es: Ficheros especiales (usualmente encontrado en I</dev\/>)

source: File formats and conventions eg I</etc/passwd>
es: Formatos de fichero y convenciones p. e. I</etc/passwd>

source: Games
es: Juegos

source: Miscellaneous (including macro packages and conventions), e.g.\& B<man>(7), B<groff>(7)
es: Diversas (incluyendo paquetes macro y conveciones), p. e. \& B<man>(7), B<groff>(7)

source: System administration commands (usually only for root)
es: Mandatos administrativos del sistema (normalmente solo para administrador)

source: Kernel routines [\|Non standard\|]
es: Rutinas del núcleo [\|No comunes\|]

source: A manual I<page> consists of several sections.
es: Una página I<page> contiene varias secciones.

source: Conventional section names include B<NAME>, B<SYNOPSIS>, B<CONFIGURATION>, B<DESCRIPTION>, B<OPTIONS>, B<EXIT\ STATUS>, B<RETURN\ VALUE>, B<ERRORS>, B<ENVIRONMENT>, B<FILES>, B<VERSIONS>, B<CONFORMING\ TO>, B<NOTES>, B<BUGS>, B<EXAMPLE>, B<AUTHORS>, and B<SEE\ ALSO>.
es: Nombres seccionales convencionales incluye B<NOMBRE>, B<SINOPSIS>, B<CONFIGURACIÓN>, B<DESCRIPCIÓN>, B<OPCIONES>, B<ESTADO\ SALIENTES>, B<VALOR\ DEVUELTO>, B<ERRORES>, B<ENTORNO>, B<FICHERO>, B<VERSIONES>, B<CONFORME\ PARA>, B<ANOTACIONES>, B<DEFECTOS>, B<EJEMPLO>, B<AUTORES>, y B<VEA\ ADEMÁS>.

source: The following conventions apply to the B<SYNOPSIS> section and can be used as a guide in other sections.
es: La siguiente convención aplica a la sección B<SINOPSIS> y puede ser utilizada como una guía en otras secciones.

source: B<bold text>
es: B<escritura resaltada>

source: type exactly as shown.
es: teclea exactamente como se muestra.

source: I<italic text>
es: I<escritura itálica>

source: replace with appropriate argument.
es: sustituye con argumentación apropiada.

source: any or all arguments within [ ] are optional.
es: cualquiera de todos los argumentos dentro de [] son opcionales.

source: options delimited by | cannot be used together.
es: opciones delimitadas por | no pueden ser empleadas juntas.

source: I<argument> .\|.\|.
es: I<argumento> .\|.\|.

source: I<argument> is repeatable.
es: I<argumento> es repetible.

source: entire I<expression>\ within [ ] is repeatable.
es: entera I<expresión>\ entre [] es repetible.

source: Exact rendering may vary depending on the output device. For instance, man will usually not be able to render italics when running in a terminal, and will typically use underlined or coloured text instead.
es: Análisis exacto quizá varíe dependiendo del dispositivo de salida. Por instancia, man usualmente no será capaz de interpretar itálicas cuando ejecuta en una terminal, y típicamente utilizará subrayado o texto coloreado en su lugar.

source: The command or function illustration is a pattern that should match all possible invocations. In some cases it is advisable to illustrate several exclusive invocations as is shown in the B<SYNOPSIS> section of this manual page.
es: El mandato o función ilustrada es un patrón que deberían coincidir con todas posibles invocaciones. En algunos casos es posible ilustrar varias invocaciones exclusivas como se muestran en la sección B<SINOPSIS> en esta página de manual.

source: Display the manual page for the I<item> (program) I<ls>.
es: Enseña la página del manual para el I<ítem> (programa) I<ls>.

source: Display the manual page for macro package I<man> from section I<7>.
es: Enseña la página del manual para empaquetado de macro I<man> desde sección I<7>.

source: B<%man%\ -a>I<\ intro>
es: B<%man%\ -a>I<\ introducir>

source: Display, in succession, all of the available I<intro> manual pages contained within the manual. It is possible to quit between successive displays or skip any of them.
es: Enseña, en sucesivos, toda I<introducción> disponible de páginas del manual contenidas dentro del manual. Es posible quitar entre varias pantallas u omitir cualquiera de ellas.

source: Format the manual page referenced by `I<alias>', usually a shell manual page, into the default B<troff> or B<groff> format and pipe it to the printer named I<ps>. The default output for B<groff> is usually PostScript. B<%man% --help> should advise as to which processor is bound to the B<-t> option.
es: Formatear la página referenciada del manual por `I<alias>', usualmente una página de manual shell, dentro del B<troff> o B<groff> predeterminado y entubarlo al nombre de la impresora I<ps>. La salida predeterminada para B<groff> es normalmente PostScript. B<%man% --help> debería avisar como cual procesador está enlazada a la opción B<-t>.

source: This command will decompress and format the nroff source manual page I<./foo.1x.gz> into a B<device independent (dvi)> file. The redirection is necessary as the B<-T> flag causes output to be directed to B<stdout> with no pager. The output could be viewed with a program such as B<xdvi> or further processed into PostScript using a program such as B<dvips.>
es: Esta función descomprimirá y formateará la página I<./foo.1x.gz> del manual origen nroff dentro de un fichero de B<dispositivo independiente (dvi)>. La redirección es necesaria como la marca B<-T> causa ser dirigido a la B<salida común> sin ningún paginador. La salida pudo ser vista con un programa tal como B<xdvi> o procesador posterior en PostScript utilizando un programa como un B<dvips.>

source: Search the short descriptions and manual page names for the keyword I<printf> as regular expression. Print out any matches. Equivalent to B<%apropos%>I<\ printf>B<.>
es: Busca la descripción corta y nombres de página manual para las teclas I<printf> como expresión regular. Escriba fuera cualquier coincidencia. Equivalente a B<%apropos%>I<\ printf>B<.>

source: B<%man%\ -f>I<\ smail>
es: B<%man%\ -f>I<\ pequeño>

source: Lookup the manual pages referenced by I<smail> and print out the short descriptions of any found. Equivalent to B<%whatis%>I<\ smail>B<.>
es: Mire las páginas del manual referecniadas por I<smail> y escriba fuera de las descripciones cortas de cualquier encontrada. Equivalente a B<%whatis%>I<\ smail>B<.>

source: OVERVIEW
es: VISTAZO

source: Many options are available to B<%man%> in order to give as much flexibility as possible to the user. Changes can be made to the search path, section order, output processor, and other behaviours and operations detailed below.
es: Multitud de opciones están disponibles para B<%man%> con el fin de dar tanta flexibilidad como sea posible al usuario. Modificaciones pueden ser hechas a la ruta de búsqueda, ordenación de sección, procesado de salida, y otros comportamientos y operaciones detalladas debajo.

source: If set, various environment variables are interrogated to determine the operation of B<%man%>. It is possible to set the `catch all' variable $B<MANOPT> to any string in command line format with the exception that any spaces used as part of an option's argument must be escaped (preceded by a backslash). B<%man%> will parse $B<MANOPT> prior to parsing its own command line. Those options requiring an argument will be overridden by the same options found on the command line. To reset all of the options set in $B<MANOPT>, B<-D> can be specified as the initial command line option. This will allow %man% to `forget' about the options specified in $B<MANOPT> although they must still have been valid.
es: Si establece, varias variables de entorno son interrogadas para determinar la operación de B<%man%>. Si es posible establecer la variable `catch all' $B<MANOPT> a cualquier cadena de texto en formato de función con la excepción que cualquier espacio utilizado como parte de un argumento opcional debe ser escapado (precedido por una barra torcida atrás). B<%man%> interpretará $B<MANOPT> antes que interpretar su propia línea de mandatos. Tales opciones requiriendo un argumento serán sobrescritos por las mismas opciones encontradas en la línea de mandatos. Para restablecer todas las opciones establezca en $B<MANOPT>, B<-D> pueden ser especificadas como la opción de línea de órdenes inicial.

source: The manual pager utilities packaged as B<man-db> make extensive use of B<index> database caches. These caches contain information such as where each manual page can be found on the filesystem and what its I<whatis> (short one line description of the man page) contains, and allow B<%man%> to run faster than if it had to search the filesystem each time to find the appropriate manual page. If requested using the B<-u> option, B<man> will ensure that the caches remain consistent, which can obviate the need to manually run software to update traditional I<whatis> text databases.
es: Las utilidades del paginador del manual como B<man-db> hacen extensible uso de caché de BD B<indexado>. Estas caché contiene información tal como donde cada página del manual puede encontrarse en el sistema de fichero y que sus I<whatis> (corta ua línea de descripción de la página man) contiene, y permite al B<%man%> ejecutar más rápido que si estuviera que buscar por todo el sistema de fichero cada vez para encontrar la página del manual apropiada. Si solicitó utilizando la opción B<-u>, B<man> asegurará que las cachés se conserven consistentes, lo cual puede obviamente requerir ejecutar manualmente software para actualizar bases de texto I<whatis> tradicional.

source: If B<%man%> cannot find a B<%mandb%> initiated B<index> database for a particular manual page hierarchy, it will still search for the requested manual pages, although file globbing will be necessary to search within that hierarchy. If B<%whatis%> or B<%apropos%> fails to find an B<index> it will try to extract information from a traditional I<whatis> database instead.
es: Si B<%man%> no puede encontrar un B<%mandb%> iniciado B<indexado> de BD para una página particular jerárquica, aún buscará para las páginas del manual solicitada, aunque la globalización del fichero será necesaria a la búsqueda dentro de esa jerarquía. Si B<%whatis%> o B<%apropos%> falla al encontrar un B<índice> intentará extraer información desde una base de datos I<whatis> tradicional en su lugar.

source: These utilities support compressed source nroff files having, by default, the extensions of B<.Z>, B<.z> and B<.gz>. It is possible to deal with any compression extension, but this information must be known at compile time. Also, by default, any cat pages produced are compressed using B<gzip>. Each `global' manual page hierarchy such as I</usr/share/man> or I</usr/X11R6/man> may have any directory as its cat page hierarchy. Traditionally the cat pages are stored under the same hierarchy as the man pages, but for reasons such as those specified in the B<File Hierarchy Standard (FHS)>, it may be better to store them elsewhere. For details on how to do this, please read B<manpath>(5). For details on why to do this, read the standard.
es: Estas utilidades apoyan tener ficheros fuente nroff comprimido, por defecto, las extensiones de B<.Z>, B<.z> y B<.gz>. Es posible tratar con cualquier extensión compresora, pero esta información debe ser conocida en tiempo de compilación. Además, por defecto, cualquieras páginas encadenadas producidas están almacenadas debajo de la misma jerarquía como las páginas man, pero por razones como aquella especificada dentro de la B<Fichero Jerárquico Normalizado (FHS, inglés)>, quizá es mejor paara almacenarlo en cualquier lugar. Para detalles en como hacer esto, lea B<manpath>(5). Para detalles en porqué hacer ésto, lea la normalización.

source: International support is available with this package. Native language manual pages are accessible (if available on your system) via use of I<locale> functions. To activate such support, it is necessary to set either $B<LC_MESSAGES>, $B<LANG> or another system dependent environment variable to your language locale, usually specified in the B<POSIX 1003.1> based format:
es: Asistencia internacional está disponible con este paquete. Páginas del manual de idioma nativo es accesible (si esta disponible en su sistema) vía del uso de funciones de I<localizaciones>. Para activar dicho apoyo, es necesario establecer o $B<LC_MESSAGES>, $B<LANG> u otra dependencia variable del entorno del sistema para su idioma local, usualmente especificado dentro del formato B<POSIX 1003.1> basado:

source: E<lt>I<language>E<gt>[\|B<_>E<lt>I<territory>E<gt>\|[\|B<.>E<lt>I<character-set>E<gt>\|[\|B<,>E<lt>I<version>E<gt>\|]\|]\|]
es: E<lt>I<idioma>E<gt>[\|B<_>E<lt>I<territorio>E<gt>\|[\|B<.>E<lt>I<conjunto de caracter>E<gt>\|[\|B<,>E<lt>I<version>E<gt>\|]\|]\|]

source: If the desired page is available in your I<locale>, it will be displayed in lieu of the standard (usually American English) page.
es: Si la página deseada está disponible en su I<localización>, será mostado en la forma de paginación estandarizada (normalmenete inglés americano).

source: Support for international message catalogues is also featured in this package and can be activated in the same way, again if available. If you find that the manual pages and message catalogues supplied with this package are not available in your native language and you would like to supply them, please contact the maintainer who will be coordinating such activity.
es: Mantenimiento para catalogación de mensajes internacional es tanbien cuna característica en este pquete y puede ser activada de la misma forma, otra vez si está disponible. Si encuentra que las págunas del manual y los mensajes catalogados proporcionados con este paquete no están disponibles en su idioma nativo y quisiera suministrarlo, contacte con el mantenedor quien será coordinado en tal actividad.

source: For information regarding other features and extensions available with this manual pager, please read the documents supplied with the package.
es: Para información restante otras características y extensiones disponible con este paginador del manual, lea el documento suministrado con el paquete.

source: DEFAULTS
es: PREDETERMINACIONES

source: B<%man%> will search for the desired manual pages within the I<index> database caches. If the B<-u> option is given, a cache consistency check is performed to ensure the databases accurately reflect the filesystem. If this option is always given, it is not generally necessary to run B<%mandb%> after the caches are initially created, unless a cache becomes corrupt. However, the cache consistency check can be slow on systems with many manual pages installed, so it is not performed by default, and system administrators may wish to run B<%mandb%> every week or so to keep the database caches fresh. To forestall problems caused by outdated caches, B<%man%> will fall back to file globbing if a cache lookup fails, just as it would if no cache was present.
es: B<%man%> buscará las páginas del manual dentro de las I<index> cachés de bases de datos. Si la B<-u> opción es dada, una caché consistente comprueba su eficiencia para asegurar que la base de datos devuelve datos precisos al sistema de ficheros. Si esta opción siempre está dada, no es generalmente necesario ejecutar B<%mandb%> tras están las cache hayan sido iniciados, a o ser que una cache se corrompa. Sin embargo, la consistencia de la comprobación de la cache pueda ser lenta en sistemas con con muchas páginas del manual instaladas, por lo que no es realizada por defecto, y los administradores del sistema quizá desean ejecutar B<%mandb%> cada semana o así, para mantener la caché actual de la base de datos. Para evitar problemas causados por caches caducadas, B<%man%> volverá al fichero global si una búsqueda por caché falla, tan solo por si ningún cache fue presentado.

source: Once a manual page has been located, a check is performed to find out if a relative preformatted `cat' file already exists and is newer than the nroff file. If it does and is, this preformatted file is (usually) decompressed and then displayed, via use of a pager. The pager can be specified in a number of ways, or else will fall back to a default is used (see option B<-P> for details). If no cat is found or is older than the nroff file, the nroff is filtered through various programs and is shown immediately.
es: Una vez que una página ha sido localizada, se efectúa una comprobación para encontrar si los ficheros concatenados reformateados ya existen y es más nuevo que el fichero nroff. Si esto ocurre y está, este preformato del fichero es (normalmente) descomprimido y después mostrado, por medio del uso de una página. El paginador puede ser especificado dentro de un número de formas, o además fallará a lo predeterminado se utilizará (vea opción B<-P> para detalles). Si no se encontr´o la concatenación o es más antigua que el fichero nroff, el nroff se filtra a través de varios programas y es mostrado inmediatamente.

source: If a cat file can be produced (a relative cat directory exists and has appropriate permissions), B<%man%> will compress and store the cat file in the background.
es: Si un fichero concatenado puede ser producido (una concatenación relativa del directoro existe y tiene permisos apropiados), B<%man%> comprimirá y almacenará el fichero concatenado en el plano del fondo.

source: The filters are deciphered by a number of means. Firstly, the command line option B<-p> or the environment variable $B<MANROFFSEQ> is interrogated. If B<-p> was not used and the environment variable was not set, the initial line of the nroff file is parsed for a preprocessor string. To contain a valid preprocessor string, the first line must resemble
es: Los filtros están descifrados por un números de significados. Primeramente, la opción de línea mandatoria B<-p> o la variable de entorno $B<MANROOFFSEQ> es interrogada. Si B<-p> no fue empleado y la variable de entorno no fue establecida, se interpreta la línea inicial del fichero nroff para una cadena de preprocesador. Para contener una cadena preprocesadora pálida, la primera línea debe reordenar

source: B<'\e"> E<lt>B<string>E<gt>
es: B<'\e"> E<lt>B<cadena>E<gt>

source: where B<string> can be any combination of letters described by option B<-p> below.
es: donde la B<cadena> puede ser cualquier combinación de letras descritas por opción B<-p> debajo.

source: If none of the above methods provide any filter information, a default set is used.
es: Si ninguna de los métodos de arriba proporiciona cualquier filtro de información, se emplea un conjunto predeterminado.

source: A formatting pipeline is formed from the filters and the primary formatter (B<nroff> or [B<tg>]B<roff> with B<-t>) and executed. Alternatively, if an executable program I<mandb_nfmt> (or I<mandb_tfmt> with B<-t>) exists in the man tree root, it is executed instead. It gets passed the manual source file, the preprocessor string, and optionally the device specified with B<-T> or B<-E> as arguments.
es: Un formato de tubería está formado desde los filtros y el formateado primario (B<nroof> o [B<tg>]B<roff> con B<-t>) y ejecutando. Alternativamente, si un programa ejecutable I<mandb_nfmt> (o I<mandb_tfmt> con B<-t>) existe dentro de la raíz del árbol man, está ejecutado en su lugar. Obtiene posterior al fichero origen del manual, la cadena preprocesada, y opcionalmente especificadas por B<-T> or B<-E> como argumentos.

source: Non argument options that are duplicated either on the command line, in $B<MANOPT>, or both, are not harmful. For options that require an argument, each duplication will override the previous argument value.
es: Ninguna de las opciones argumentales que sean duplicadas o en la línea mandatoria, en $B<MANOPT>, o ambas, no esan completamente perjudicial. Para opciones que requieran un argumento, cada duplicación sobrescribirá el valor del argumento anterior.

source: General options
es: Opciones comunes

source: This option is normally issued as the very first option and resets B<%man%'s> behaviour to its default. Its use is to reset those options that may have been set in $B<MANOPT>. Any options that follow B<-D> will have their usual effect.
es: Esta opción es comunmente efectuada como la primera opción y reinicia comportamiento de B<%man%> a éste predeterminado. Se utiliza para restablecer aquellas opciones que quizá han sido establecidas en $B<MANOPT>. Cualquier opción que siga B<-D> tendrá su efecto común.

source: B<--warnings>[=I<warnings\/>]
es: R<--warnings>[=I<aviso\/>]

source: Enable warnings from I<groff>. This may be used to perform sanity checks on the source text of manual pages. I<warnings> is a comma-separated list of warning names; if it is not supplied, the default is "mac". See the \(lqWarnings\(rq node in B<info groff> for a list of available warning names.
es: Activa advertencias desde I<groff>. Esta forma será empleada para realizar comprobaciones de corrección en el texto origen de páginas del manual. I<advertencia> es una lista separadas por comas de nombres de advertencias; si no es compatible, lo predeterminado es «mac». Vea el nodo \(lqAdvertencia\(rq en B<info groff> para una lista de nombres de advertencias disponibles.

source: Main modes of operation
es: Modos principales de operación

source: Equivalent to B<%whatis%>. Display a short description from the manual page, if available. See B<%whatis%>(1) for details.
es: Equivalente a B<%whatis%>. Enseña una descripción breve desde la página del manual, si está disponible. Vea B<%whatis%>(1) para más detalles.
